<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Cubase LE AI Elements 9.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Cubase LE AI Elements 9</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CubaseLEAIElements9</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://download.steinberg.net/downloads_software/Cubase_LE_AI_Elements_9/+[0-9]+\.+[0-9]+\.+[0-9][0-9]/Cubase_LE_AI_Elements_+[0-9]+\.+[0-9]+\.+[0-9][0-9]_Update_mac.dmg</string>
				<key>url</key>
				<string>https://www.steinberg.net/en/support/downloads/cubase_9.html</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Cubase LE AI Elements 9 Update.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Steinberg Media Technologies GmbH (5PMY476BJ6)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>      
    </array>
</dict>
</plist>