<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Yamaha USB-MIDI Driver.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Yamaha USB-MIDI Driver</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>YamahaUSB-MIDIDriver</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"/files/download/software/(\d/[0-9]+/[A-Za-z0-9]+\.zip)\"</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://uk.yamaha.com/en/support/updates/usb_midi_driver_for_mac.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>([a-zA-Z]+[0-9]+[a-zA-Z]+)\.zip</string>
                <key>result_output_var_name</key>
                <string>folder_name</string>
                <key>url</key>
                <string>https://uk.yamaha.com/en/support/updates/usb_midi_driver_for_mac.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>USB-MIDI Driver ((V([0-9]+(\.[0-9]+)+))) for Mac macOS</string>
                <key>result_output_var_name</key>
                <string>driver_version</string>
                <key>url</key>
                <string>https://uk.yamaha.com/en/support/updates/usb_midi_driver_for_mac.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>https://uk.yamaha.com/files/download/software/%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Yamaha Corporation (5LE7A8CF65)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*/Yamaha USB-MIDI Driver*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
