<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Soundvision.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Soundvision</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Soundvision</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>Current version:\s+&lt;span class=\&quot;version\&quot;&gt;([0-9]+(\.[0-9]+)+)&lt;/span&gt;</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://www.l-acoustics.com/products/soundvision/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>data-renderer-mark=\"true\">([A-Za-z][A-Za-z][A-Za-z]).*? [0-9]+</string>
                <key>result_output_var_name</key>
                <string>month</string>
                <key>url</key>
                <string>https://www.l-acoustics.com/products/soundvision/#</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>data-renderer-mark=\"true\">[A-Za-z][A-Za-z][A-Za-z].*? ([0-9]+)</string>
                <key>result_output_var_name</key>
                <string>year</string>
                <key>url</key>
                <string>https://www.l-acoustics.com/products/soundvision/#</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.2 Safari/605.1.15</string>
                </dict>
                <key>url</key>
                <string>https://prdstglaxxwe001.blob.core.windows.net/webapp-lacoustics/documentation/SOFTWARE/Soundvision/Soundvision/Mac/%version%/Soundvision_%version%_%month%_%year%_MAC.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip/Soundvision_%version%_%month%_%year%_MAC/LA_Soundvision_Installer_%version%.dmg/Soundvision.app</string>
                <key>requirement</key>
                <string>identifier "com.l-acoustics.Soundvision%version%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4WPJ48N2K4"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
