<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of AMS Neve GenesysControl Plugin for macOS - 10.11-10.14 and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.AMS Neve GenesysControl Plugin - 10.11-10.14</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AMSNeveGenesysControlPlugin</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>This exciting DAW plugin for the iconic Neve Genesys and Genesys Black consoles gives DAW users the ability to connect to and control the console’s analogue hardware and also automate the EQ and Dynamics processing parameters, fader levels, channel strip settings and more.</string>
            <key>display_name</key>
            <string>AMS Neve GenesysControl plugin</string>
            <key>maximum_os_version</key>
            <string>10.14.6</string>
            <key>minimum_os_version</key>
            <string>10.11</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.AMS Neve GenesysControl Plugin - 10.11-10.14</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/Application Support/Avid/Audio/Plug-Ins/GenesysControl.aaxplugin</string>
                </array>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Application Support/Avid/Audio/Plug-Ins/GenesysControl.aaxplugin/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>