<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of GoPro FX Reframe plugin and creates a new package, as the supplied pkg's receipt is no use and the artefacts on disk do not hold valid versioning.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.GoPro FX Reframe plugin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoProFXReframePlugin</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.GoPro FX Reframe plugin</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>index</key>
                <integer>4</integer>
                <key>split_on</key>
                <string>-</string>
                <key>version</key>
                <string>%url%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>index</key>
                <integer>0</integer>
                <key>split_on</key>
                <string>.pkg</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/Application Support</key>
                    <string>0755</string>
                    <key>Library/Application Support/Adobe</key>
                    <string>0755</string>
                    <key>Library/Application Support/Adobe/Common</key>
                    <string>0755</string>
                    <key>Library/Application Support/Adobe/Common/Plug-ins</key>
                    <string>0755</string>
                    <key>Library/Application Support/Adobe/Common/Plug-ins/7.0</key>
                    <string>0755</string>
                    <key>Library/Application Support/Adobe/Common/Plug-ins/7.0/MediaCore</key>
                    <string>0755</string>
                    <key>Library/Application Support/Adobe/Common/Plug-ins/7.0/MediaCore/GoPro</key>
                    <string>0755</string>
                    <key>scripts</key>
                    <string>0755</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Application Support/Adobe/Common/Plug-ins/7.0/MediaCore/GoPro</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/scripts/preinstall</string>
                <key>overwrite</key>
                <true/>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Scripts/cleanold</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/scripts/preinstall</string>
                <key>mode</key>
                <string>a+x</string>
            </dict>
            <key>Processor</key>
            <string>com.github.jessepeterson.munki.UniversalTypeClient6/ModeChanger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                    <key>id</key>
                    <string>com.gopro.AfterEffects.OCFX</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgroot</key>
                    <string>%pkgroot%</string>
                    <key>scripts</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/scripts/</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
