<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the GoPro FX Reframe plugin.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.GoPro FX Reframe plugin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoProFXReframePlugin</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Download now behind javascript - https://github.com/autopkg/dataJAR-recipes/issues/206</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://community\.gopro\.com/html/assets/GoPro-FX-Reframe-Plugin-.*?.pkg</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://community.gopro.com/t5/en/GoPro-FX-Reframe/ta-p/412890</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: GoPro, Inc. (5R97Y7Q7FD)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>