<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Clocker.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Clocker</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Clocker</string>
        <key>PRERELEASE</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>n0shake/Clocker</string>
                <key>include_prereleases</key>
                <string>%PRERELEASE%</string>
                <key>asset_regex</key>
                <string>Clocker.app.zip</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>