<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of AMS Neve GenesysControl Plugin and imports into Munki.

Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.AMS Neve GenesysControl Plugin</string>
    <key>Input</key>
    <dict>
        <key>DERIVE_MIN_OS</key>
        <string>YES</string>
        <key>NAME</key>
        <string>AMS Neve GenesysControl Plugin</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>This exciting DAW plugin for the iconic Neve Genesys and Genesys Black consoles gives DAW users the ability to connect to and control the console’s analogue hardware and also automate the EQ and Dynamics processing parameters, fader levels, channel strip settings and more.</string>
            <key>display_name</key>
            <string>AMS Neve GenesysControl Plugin</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.AMS Neve GenesysControl Plugin</string>
    <key>Process</key>
    <array>
     <dict>
   <key>Processor</key>
   <string>FlatPkgUnpacker</string>
   <key>Arguments</key>
   <dict>
    <key>destination_path</key>
    <string>%RECIPE_CACHE_DIR%/unpack</string>
    <key>flat_pkg_path</key>
    <string>%found_filename%</string>
    <key>purge_destination</key>
    <true/>
   </dict>
  </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/Application Support</key>
                    <string>0755</string>
                    <key>Library/Application Support/Avid</key>
                    <string>0775</string>
                    <key>Library/Application Support/Avid/Audio</key>
                    <string>0775</string>
                    <key>Library/Application Support/Avid/Audio/Plug-Ins</key>
                    <string>0775</string>
                    <key>Library/Audio</key>
                    <string>0755</string>
                    <key>Library/Audio/Plug-Ins</key>
                    <string>0755</string>
                    <key>Library/Audio/Plug-Ins/VST</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
  <dict>
   <key>Processor</key>
   <string>PkgPayloadUnpacker</string>
   <key>Arguments</key>
   <dict>
    <key>destination_path</key>
    <string>%RECIPE_CACHE_DIR%/payload/</string>
    <key>pkg_payload_path</key>
    <string>%RECIPE_CACHE_DIR%/unpack/AAX.pkg/Payload</string>
    <key>purge_destination</key>
    <true/>
   </dict>
  </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Avid/Audio/Plug-Ins/GenesysControl.aaxplugin</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/GenesysControl.aaxplugin</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>derive_minimum_os_version</key>
                <string>%DERIVE_MIN_OS%</string>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/Application Support/Avid/Audio/Plug-Ins/GenesysControl.aaxplugin</string>
                </array>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Avid/Audio/Plug-Ins/GenesysControl.aaxplugin/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>LSMinimumSystemVersion</key>
                    <string>minimum_os_version</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%minimum_os_version%</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/unzip</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>