<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Spectrolite.

To download Apple Silicon use: "-silicon" in the DOWNLOAD_ARCH variable
To download Intel leave DOWNLOAD_ARCH variable empty</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Spectrolite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Spectrolite</string>
        <key>DOWNLOAD_ARCH</key>
        <string>-silicon</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://spectrolite.app/downloads/Spectrolite%DOWNLOAD_ARCH%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Spectrolite.app</string>
                <key>requirement</key>
                <string>identifier "com.electron.spectrolite" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = P4DM2JAS3V</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
