<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of pgAdmin 4.

For Intel use: "x86_64" in the ARCH_TYPE variable
For Apple Silicon use: "arm64" in the ARCH_TYPE variable</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.pgAdmin4</string>
    <key>Input</key>
    <dict>
        <key>ARCH_TYPE</key>
        <string>x86_64</string>
        <key>NAME</key>
        <string>pgAdmin4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Consider switching to the pgAdmin4 recipes in the bnpl-recipes repo. This recipe is deprecated and will be removed in the future.</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(https://www\.postgresql\.org/ftp/pgadmin/pgadmin4/.*/macos/)\"&gt;pg</string>
                <key>url</key>
                <string>https://www.pgadmin.org/download/pgadmin-4-macos/</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>((https://ftp\.postgresql\.org/pub/pgadmin/pgadmin4/v([0-9]+(\.[0-9]+)+)/macos/pgadmin4-([0-9]+(\.[0-9]+)+)-%ARCH_TYPE%\.dmg))\"&gt;&lt;</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/pgAdmin 4.app</string>
                <key>requirement</key>
                <string>identifier "org.pgadmin.pgadmin4" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TCHGL2R7C5</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
