<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Wing 101.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Wing 101</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wing 101</string>
        <key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_6) AppleWebKit/603.3.8 (KHTML, like Gecko) Version/10.1.2 Safari/603.3.8</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://wingware.com/downloads/wingide-101</string>
				<key>re_pattern</key>
				<string>(http://wingware.com/pub/wingide-[0-9][0-9][0-9]/[0-9].[0-9].[0-9]/wingide-[0-9][0-9][0-9]-[0-9].[0-9].[0-9]-[0-9].dmg)</string>
	      		<key>result_output_var_name</key>
				<string>url</string>
	      		<key>request_headers</key>
	      		<dict>
	      			<key>user-agent</key>
					<string>%USER_AGENT%</string>
	     		</dict>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
