<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Wing 101.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Wing 101</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wing 101</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://wingware.com/downloads/wing-101</string>
                <key>re_pattern</key>
                <string>/downloads/wing-101/.*/binaries&amp;os=macos</string>
                <key>result_output_var_name</key>
                <string>macos_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://wingware.com/%macos_url%</string>
                <key>re_pattern</key>
                <string>/get&amp;prod=wing-101&amp;target=(pub/wing-101/.*/wing-101-.*\.dmg)</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://wingware.com/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Wing 101.app</string>
                <key>requirement</key>
                <string>identifier "com.wingware.wing-101" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9D63R52894"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>