<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Wing 101 and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Wing 101</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wing 101</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Wing is a Python IDE with powerful debugger and intelligent editor that make interactive Python development fast, accurate, and fun.</string>
            <key>developer</key>
            <string>Wingware</string>
            <key>display_name</key>
            <string>Wing 101</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
#
# Copyright (c) 2021, dataJAR Ltd.  All rights reserved.
#

# Delete old app, if found

oldApp="/Applications/Wing101.app"

if [ -d "${oldApp}" ]
then
    /bin/echo "Found ${oldApp}, deleting..."
    /bin/rm -rf "${oldApp}"
    /bin/echo "Deleted, ${oldApp}..."
fi</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Wing 101</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
