<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Sawgrass Print Utility and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Sawgrass Print Utility</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SawgrassPrintUtility</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Sawgrass Print Utility makes it easier than ever to create professional-quality sublimated products.

With a user-friendly interface and advanced features, Sawgrass Print Utility streamlines your printing workflow, allowing you to achieve incredible print quality with minimal effort. Whether you’re new to sublimation printing or a seasoned pro, Sawgrass Print Utility is the perfect solution for simplifying your sublimation process and helping you create amazing sublimated products with ease.</string>
            <key>developer</key>
            <string>Sawgrass Technologies, Inc.</string>
            <key>display_name</key>
            <string>Sawgrass Print Utility</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Sawgrass Print Utility</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
