<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of LM Studio and imports it into Munki.

Please note there is no x86_64 installer available only arm64.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.LM Studio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LMStudio</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Your local AI toolkit.

Download and run Llama, DeepSeek, Mistral, Phi on your computer.</string>
            <key>developer</key>
            <string>Element Labs Inc</string>
            <key>display_name</key>
            <string>LM Studio</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>supported_architectures</key>
            <array>
                <string>arm64</string>
            </array>
            <key>unattended_install</key>
            <true/>
            <key>unattended_unnstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.almenscorner.download.LMStudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
