<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of  ScreenPal 3</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.ScreenPal 3</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ScreenPal3</string>
            <key>DOWNLOAD_URL</key>
            <string>https://screenpal.com/getappdownload?platform=mac</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Big Nerd Software, LLC (48Z4QVLCS5)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
