<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Logitech G HUB and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Logitech G HUB</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LogitechGHUB</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>ASSIGN. TUNE. IMMERSE. PLAY.

Where the community connects with endless possibilities.</string>
            <key>developer</key>
            <string>Logitech Inc.</string>
            <key>display_name</key>
            <string>Logitech G HUB</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/zsh --no-rcs

# Uninstall Logitech G HUB
# Vendors documentation: https://support.logi.com/hc/en-us/articles/360023192454-G-HUB-Install-Uninstall-Update-Troubleshooting

# Remove application
if [ -e "/Applications/lghub.app" ]; then
    /bin/rm -rf "/Applications/lghub.app"
fi

# Remove shared data
if [ -e "/Users/Shared/LGHUB" ]; then
    /bin/rm -rf "/Users/Shared/LGHUB"
fi

# Remove application support
if [ -e "/Library/Application Support/LGHUB" ]; then
    /bin/rm -rf "/Library/Application Support/LGHUB"
fi

# Remove launch agents
if [ -e "/Library/LaunchAgents/com.logi.ghub.plist" ]; then
    /bin/rm -f "/Library/LaunchAgents/com.logi.ghub.plist"
fi

# Remove launch daemons
if [ -e "/Library/LaunchDaemons/com.logi.ghub.updater.plist" ]; then
    /bin/rm -f "/Library/LaunchDaemons/com.logi.ghub.updater.plist"
fi

# Forget package receipt
/usr/sbin/pkgutil --forget "com.logi.ghub"

exit 0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.grahampugh.recipes.pkg.LogitechGHUB</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
