<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Import a Creative Cloud Application's pkg into Munki</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.munki.Import Adobe 2020 Title</string>
        <key>Input</key>
        <dict>
            <key>MINIMUM_OS_VERSION</key>
            <string>10.14.0</string>
            <key>MUNKI_CATEGORY</key>
            <string>Applications</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Some description.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Adobe</string>
            <key>NAME</key>
            <string>SomeAdobe2020Title</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>RestartAction</key>
                <string>RequireLogout</string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe has been replaced by: https://github.com/autopkg/dataJAR-recipes/tree/master/Adobe%20Admin%20Console%20Packages</string>
                </dict>
            </dict>
            <dict>   
                <key>Processor</key>   
                <string>StopProcessingIf</string>   
                <key>Arguments</key>   
                <dict>   
                    <key>predicate</key>   
                    <string>TRUEPREDICATE</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Adobe2020Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%pkg_path%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Install-%version%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%uninstaller_pkg_path%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall-%version%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                        <key>installer_type</key>
                        <string></string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Install-%version%.dmg</string>
                    <key>uninstaller_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall-%version%.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
