<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of ArrayCalc V12.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.ArrayCalc V12</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ArrayCalcV12</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>http://swupdate\.dbaudio\.com/net_update/ArrayCalc_V12/ArrayCalc_V([0-9]+(\.[0-9]+)+)\.dmg</string>
                <key>url</key>
                <string>https://swupdate.dbaudio.com/net_update/ArrayCalc_V11_WebUpdate.xml</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://swupdate.dbaudio.com/net_update/ArrayCalc_V12/ArrayCalc_V%match%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/ArrayCalc V12.app</string>
                <key>requirement</key>
                <string>identifier "com.dbaudio.ArrayCalcV12" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = G24Y233R69</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
