<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest trial version of the Millumin4.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Millumin4</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_KEY</key>
        <string>Q05hNTBVV3RaVmRKTkVPbmxWYldWWFNEaEdSTlJFWkhObGVHaGxVV1ZrTVZSVVF3bDBRNFlIVDVoamRKUlVSdzhrYXJSelRxTjJNUHBtU3Q5VWJHaDJUcUZGTkpORU8yeFVlNFlYU0hoSGNaSmpWMU5tTVZsRFpJcEVjWmRGZW0xa2VGTlhTREpFYVpSRk01eDBRQmRtWXowVU9OUlZVMTUwUTBjSFRERjBaakpEYnVKV2JHQkRaWXBFYlFSVlJ6bDBRQ3BXWUhabGFocEhNNHhrZUJOWFNESkVkYWhsVW9KR1J3Z0hUREYwWlpOalF4UUdTc2RuV1VCRGVPcDJZejRrZUpsM1REZDNaSmRrVDNSR1ZaQlRXdHhHTVFSVlJ6bDBRQ3AyWUlabGVrZGxTd1VHV0N4R1VVbDBjSk5rUTBKbU1TeG1ZRUZqVFpkbFQwRjJWMUEzVFRkSGVNTlVRbkpXYk9kSFpVQkROTU5VUW5KMlJHVm5XNkZEYmlsV01JRlZhM2RXU0hWemFoaGxUM0oyUkdWRFVVVjBjSk5rUTVsMVZ4NFVVcUJEZU9wV1QwNDBRM2RXU0IxVFBNRjBaUU4x</string>
        <key>NAME</key>
        <string>Millumin4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>appcast_request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Millumin4/4 Sparkle</string>
                </dict>
                <key>appcast_url</key>
                <string>https://update.millumin.com/appcast.php</string>
            </dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%url%%DOWNLOAD_KEY%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Millumin4.app</string>
                <key>requirement</key>
                <string>identifier "com.anomes.millumin.v2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XP6394Y4X5</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
