<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Egnyte Drive.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.Egnyte Drive</string>
	<key>Input</key>
	<dict>
		<key>LOCALE</key>
		<string>en-us</string>
		<key>NAME</key>
		<string>Egnyte Drive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"https:\/\/egnyte-cdn\.egnyte\.com\/egnytedrive\/mac\/%LOCALE%\/(?P&lt;version&gt;[\d\.]+)\/EgnyteConnect_[\d\.]+_(?P&lt;match&gt;[\w]+)\.pkg"</string>
				<key>url</key>
				<string>https://helpdesk.egnyte.com/hc/%LOCALE%/articles/205237150-Download-Desktop-App-Egnyte-Drive-Installers</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>EgnyteDrive.pkg</string>
				<key>url</key>
				<string>https://egnyte-cdn.egnyte.com/egnytedrive/mac/%LOCALE%/%version%/EgnyteConnect_%version%_%match%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Egnyte Inc (FELUD555VC)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
