<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of TouchDesigner and imports it into Munki.

For Intel downloads use x86_64 for the "SUPPORTED_ARCH" variable

For Apple Silicon downloads use arm64 for the "SUPPORTED_ARCH" variable</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.TouchDesigner</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TouchDesigner</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>SUPPORTED_ARCH</key>
        <string>x86_64</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>TouchDesigner for macOS is a powerful, node-based visual programming tool for real-time interactive media, offering deep creative control for artists and developers</string>
            <key>developer</key>
            <string>Derivative</string>
            <key>display_name</key>
            <string>TouchDesigner</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>preinstall_script</key>
            <string>#!/bin/bash

# TouchDesigner requires admin rights on launch. This script creates the necessary folder if missing and sets the required permissions. See the following documentation for further details: https://derivative.ca/UserGuide/Install_TouchDesigner

/bin/mkdir -p "/Library/Application Support/ca.derivative"
/bin/chmod 775 "/Library/Application Support/ca.derivative"
/usr/bin/chgrp -R admin "/Library/Application Support/ca.derivative"

exit</string>
            <key>supported_architectures</key>
            <array>
                <string>%SUPPORTED_ARCH%</string>
            </array>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.download.touchdesigner</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
