<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Citrix Files for Mac and imports into pkg.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.Citrix Files for Mac</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Citrix Files for Mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Citrix Files for Mac</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%pkg_path%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                <string>%RECIPE_CACHE_DIR%/application_payload/</string>
                <string>%RECIPE_CACHE_DIR%/unpack</string>                              
                </array>
            </dict>
        </dict> 
    </array>
</dict>
</plist>
