<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of GMetrixSMSe and then uploads to the JSS.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.jss.GMetrixSMSe</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Applications</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
        <key>GROUP_TEMPLATE</key>
        <string>SmartGroupTemplate.xml</string>
        <key>NAME</key>
        <string>GMetrixSMSe</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>PolicyTemplate.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>GMetrix SMS provides practice material for:
- Microsoft Office 2013, 2016, 2019 (Windows only)
- Adobe CC 2018/2019
- Adobe CC 2013/2015
- Adobe CS6
- Autodesk Certified User 2017 - 2020 (Windows only)
- Autodesk Certified Professional 2017 - 2020 (Windows only)
- Microsoft Technology Associate
- IC3 GS4/GS5/Spark
- CompTIA
- QuickBooks Certified User
- Microsoft Certified Educator (MCE)
- Entrepreneurship and Small Business
- EC-Council Associate</string>
        <key>SELF_SERVICE_ICON</key>
        <string>GMetrixSMSe.png</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.GMetrixSMSe</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>prod_name</key>
                <string>4K Video Downloader</string>
                <key>self_service_description</key>
                <string>%SELF_SERVICE_DESCRIPTION%</string>
                <key>self_service_icon</key>
                <string>%SELF_SERVICE_ICON%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>