<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of GMetrixSMSe and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.GMetrixSMSe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GMetrixSMSe</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>GMetrix SMS provides practice material for:
- Microsoft Office 2013, 2016, 2019 (Windows only)
- Adobe CC 2018/2019
- Adobe CC 2013/2015
- Adobe CS6
- Autodesk Certified User 2017 - 2020 (Windows only)
- Autodesk Certified Professional 2017 - 2020 (Windows only)
- Microsoft Technology Associate
- IC3 GS4/GS5/Spark
- CompTIA
- QuickBooks Certified User
- Microsoft Certified Educator (MCE)
- Entrepreneurship and Small Business
- EC-Council Associate</string>
            <key>developer</key>
            <string>GMetrix</string>
            <key>display_name</key>
            <string>GMetrixSMSe</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.GMetrixSMSe</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
