<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Nitro PDF Pro.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.NitroPDFPro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Nitro PDF Pro</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>Latest .ersion:.*([0-9]+(\.[0-9]+)+)</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://www.gonitro.com/product-details/release-notes/mac</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://downloads.gonitro.com/macos/Nitro%20PDF%20Pro_%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Nitro PDF Pro.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.gonitro.NitroPDFPro" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "37C4TX3D45")</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
