<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MuseScore 3 and imports it into Munki.

These recipes differ from https://github.com/autopkg/jazzace-recipes/tree/master/MuseScore, as are version specific.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.MuseScore 3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MuseScore3</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>MuseScore is a scorewriter for Windows, OS X, and Linux. Created by Werner Schweer, it is released as free and open source software under the GNU General Public License. It has a feature set comparable to Finale and Sibelius, supporting a wide variety of file formats and input methods.</string>
            <key>developer</key>
            <string>MuseScore BVBA</string>
            <key>display_name</key>
            <string>MuseScore 3</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.MuseScore 3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
