<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Universal Control</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.PreSonus Universal Control</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>PreSonusUniversalControl</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>result_output_var_name</key>
                    <string>match</string>
                    <key>re_pattern</key>
                    <string>https://www.fmicassets.com/Damroot/Original/10111/PreSonus_Universal_Control_.*?.dmg</string>
                    <key>url</key>
                    <string>https://uk.presonus.com/products/atom-sq-controller#:~:text=SQ%20Controller%20%2D%20English-,Software,-Universal%20Control</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/PreSonus Universal Control.pkg</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: PreSonus Software Limited (Q524P4NWE7)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
