<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Apple's AU Lab.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.Apple AU Lab</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AMBEO A-B Converter</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
			     <key>url</key>
			     <string>https://images.apple.com/itunes/mastered-for-itunes/docs/au_lab.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Applications/</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%pkgroot%</string>
				<key>purge_destination</key>
				<true/>
				<key>archive_format</key>
				<string>zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%destination_path%/AU Lab.app</string>
				<key>requirement</key>
				<string>identifier "com.apple.audio.aulab" and anchor apple</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
