<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version Rhinoceros 7.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Rhinoceros 7</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Rhinoceros 7</string>
        <key>SEARCH_URL</key>
        <string>https://files.mcneel.com/rhino/7/mac/updates/commercialUpdates.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>These recipes have been renamed Rhino 7, and can be found at: https://github.com/autopkg/dataJAR-recipes/tree/master/Rhino%207.</string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>sparkle:version="(?P&lt;version&gt;([0-9.]+))</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>url="(?P&lt;url&gt;http.*.dmg)</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Rhino 7.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.mcneel.rhinoceros.7" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = D6XDM4N99E)</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
