<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Citrix Files for Mac and then uploads to the JSS</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.jss.Citrix Files for Mac</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Applications</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
        <key>GROUP_TEMPLATE</key>
        <string>SmartGroupTemplate.xml</string>
        <key>NAME</key>
        <string>Citrix Files for Mac</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>PolicyTemplate.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>Citrix Files for Mac allows users with a ShareFile license to interact with all their files directly from the Finder. Files do not need to be synced locally. Quick access to sharing, requesting, and other file options are available through the right click menu.</string>
        <key>SELF_SERVICE_ICON</key>
        <string>CitrixFiles.png</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.Citrix Files for Mac</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Due to an upcoming breaking change by Jamf this recipe has been deprecated, and will be removed from this repo at a future date.

Please urgently consider moving to Jamf-Uploader. There are some excellent resourses availabe on Graham Pugh’s blog: https://grahamrpugh.com/archives/index.html</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
                <key>pkg_path</key>
                <string>%target%</string>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>prod_name</key>
                <string>Citrix Files for Mac</string>
                <key>self_service_description</key>
                <string>%SELF_SERVICE_DESCRIPTION%</string>
                <key>self_service_icon</key>
                <string>%SELF_SERVICE_ICON%</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
