<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ShareFile Sync disk image and then uploads to the JSS.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.jss.ShareFile Sync</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Productivity</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
        <key>GROUP_TEMPLATE</key>
        <string>SmartGroupTemplate.xml</string>
        <key>NAME</key>
        <string>ShareFile Sync</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>PolicyTemplate.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>ShareFile Sync for Mac is designed to provide ShareFile customers with an easy way to access and synchronize personal folders from your ShareFile account to your local computer.</string>
        <key>SELF_SERVICE_ICON</key>
        <string>ShareFileSync.png</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.ShareFile Sync</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>ShareFile Sync has been replaced with Citrix Files for Mac. Recipes are available for Files for Mac.</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
