<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Perimeter 81.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Perimeter 81</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Perimeter81</string>
        <key>DOWNLOAD_URL</key>
        <string>https://static.perimeter81.com/apps/osx/Perimeter81.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Perimeter81.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Safer Social Ltd. (924635PD62)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
