<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Perimeter 81 and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.Perimeter 81</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Perimeter 81</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.8</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Perimeter 81</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Perimeter81.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/installer_unpack</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/installer_payload/Applications</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/installer_unpack/Payload</string>
                <key>purge_destination</key>
                <true />
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/installer_payload/Applications/Perimeter 81.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Perimeter81.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
