<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Coot.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Coot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Coot</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://scottlab.ucsc.edu/coot/stable</string>
                <key>re_pattern</key>
                <string>(coot_[0-9a-z\.]+\.[0-9a-z\.]+\.[0-9a-z\.]+\_stable_[0-9a-z\.]+\.[0-9a-z\.]+\.[0-9a-z\.]+\.pkg.zip)</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%/%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%match%</string>
                <key>index</key>
                <integer>1</integer>
                <key>split_on</key>
                <string>_</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
