<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports the latest version of Polycom Content App into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.PolycomContentApp</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/polycom</string>
        <key>NAME</key>
        <string>PolycomContentApp</string>
        <key>SEARCH_URL</key>
        <string>https://support.polycom.com/content/support/north-america/usa/en/support/video/polycom-content-app.html</string>
        <key>POLYCOMRPDESKTOP_DMG_REPATTERN</key>
        <string>https://downloads\.polycom\.com/video/content-app/PolycomContentApp_(?P&lt;version&gt;.*?_.*?_.*?)_(?P&lt;bundle_version&gt;.*?)\.dmg</string>
        <key>pkginfo</key>
        <dict>
        	<key>blocking_applications</key>
			<array>
				<string>Polycom Content App</string>
			</array>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>Polycom</string>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>The easiest way to share content at work</string>
            <key>display_name</key>
            <string>Polycom Content App</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.PolycomContentApp</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/PolycomContentApp.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Polycom Content App.app</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Polycom Content App.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleVersion</key>
					<string>version</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot/</string>  
					<string>%RECIPE_CACHE_DIR%/unpack/</string>                      
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
