<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of QL Editor.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.QL Editor</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>QLEditor</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(/files/download/software/[A-Za-z0-9]+/[A-Za-z0-9]+/ql_edt[0-9]+_mac\.zip)\"</string>
                <key>request_headers</key>
                <dict>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>navigate</string>
                    <key>Sec-Fetch-Site</key>
                    <string>none</string>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
                </dict>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
                <key>url</key>
                <string>https://usa.yamaha.com/support/updates/ql_edt_mac.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>request_headers</key>
                <dict>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Referer</key>
                    <string>https://usa.yamaha.com/support/updates/ql_edt_mac.html</string>
                    <key>Sec-Fetch-Dest</key>
                    <string>document</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>navigate</string>
                    <key>Sec-Fetch-Site</key>
                    <string>same-origin</string>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/26.2 Safari/605.1.15</string>
                </dict>
                <key>url</key>
                <string>https://usa.yamaha.com%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*/Install QL Editor*.pkg</string>
                <key>requirement</key>
                <array>
                    <string>Developer ID Installer: Yamaha Corporation (5LE7A8CF65)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*/Uninstall QL Editor.app</string>
                <key>requirement</key>
                <string>identifier "com.yamaha.uninstaller.qleditor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5LE7A8CF65"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
