<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import a Creative Cloud Application's pkg into Munki
        Please Review the changes to this recipe here
        https://github.com/autopkg/dataJAR-recipes/blob/master/Adobe%202021/README.md</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Import Adobe 2021 Title</string>
    <key>Input</key>
    <dict>
        <key>MINIMUM_OS_VERSION</key>
        <string>10.14.0</string>
        <key>MUNKI_CATEGORY</key>
        <string>Applications</string>
        <key>MUNKI_DESCRIPTION</key>
        <string>Some description.</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Adobe</string>
        <key>MUNKI_NAME</key>
        <string>SomeAdobe2021Title</string>
        <key>NAME</key>
        <string>SomeAdobe2021Title - must match package name</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
        <key>force_munkiimport</key>
        <true/>
        <key>pkginfo</key>
        <dict>
            <key>RestartAction</key>
            <string>RequireLogout</string>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>%MUNKI_DESCRIPTION%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Adobe2021Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_Install%architecture_type%-%version%.dmg</string>
                <key>dmg_root</key>
                <string>%pkg_path%</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall%architecture_type%-%version%.dmg</string>
                <key>dmg_root</key>
                <string>%uninstaller_pkg_path%</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installer_type</key>
                    <string></string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_Install%architecture_type%-%version%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>uninstaller_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall%architecture_type%-%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
