<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of CAJViewer</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.CAJViewer</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>CAJViewer</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>(https://cajviewer.oversea.cnki.net/down/CAJViewer-([0-9]+(.[0-9]+)+)-\d.dmg)</string>
                    <key>result_output_var_name</key>
                    <string>DOWNLOAD_URL</string>
                    <key>url</key>
                    <string>https://cajviewer.oversea.cnki.net/en/download.html</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/CAJViewer.app</string>
                    <key>requirement</key>
                    <string>identifier "com.cnki.cajviewer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = X5E8EVR68Y</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
