<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of CAJViewer and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.CAJViewer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CAJViewer</string>
        <key>PKG_ID</key>
        <string>com.cnki.cajviewer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.CAJViewer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/*.app</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://cajviewer.oversea.cnki.net/down/CAJViewer-([0-9]+(.[0-9]+)+)-\d.dmg</string>
                <key>result_output_var_name</key>
                <string>VERSION</string>
                <key>url</key>
                <string>https://cajviewer.oversea.cnki.net/en/download.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>root/Applications</key>
                    <string>0777</string>
                    <key>scripts</key>
                    <string>0755</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/root/Applications/CAJViewer.app</string>
                <key>source_path</key>
                <string>%pathname%/%found_basename%</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>pkgname</key>
                    <string>CAJViewer-%VERSION%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/payload/root</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
