<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DJI Assistant 2 (Enterprise Series).</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.DJI Assistant 2 (Enterprise Series)</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DJIAssistant2EnterpriseSeries</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.dji.com/uk/downloads/softwares/assistant-dji-2-for-matrice</string>
                <key>re_pattern</key>
                <string>https://dl\.djicdn\.com/downloads/dji_assistant/.*?/DJI\+Assistant\+2\+\(Enterprise\+Series\)\+.*?\.pkg</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36</string>
                </dict>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>