<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of FontLab 7-Trial and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.FontLab 7-Trial</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FontLab7-Trial</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>The pro font editor, evolved.</string>
            <key>display_name</key>
            <string>FontLab 7-Trial</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
#
# Copyright (c) 2020, dataJAR Ltd.  All rights reserved.
#
# v7: https://help.fontlab.com/fontlab/7/manual/FontLab-Multi-Seat-License-Setup/
#
# Set licenseServer &amp; licenseServerPort as needed

licenseServer=""
licenseServerPort=""

licenseFile="com.fontlab.fl70.lic"
prefPath="/Library/Preferences/"


if [ -n "${licenseServer}" ] &amp;&amp; [ -n "${licenseServerPort}" ]
then
    /bin/echo "Creating ${prefPath}${licenseFile}..."
    /bin/echo "HOST ${licenseServer} ANY ${licenseServerPort}" > "${prefPath}""${licenseFile}"
    /bin/echo -n "ISV fontlab" >> "${prefPath}""${licenseFile}"
    /bin/echo "Making ${prefPath}${licenseFile} executable..."
    /bin/chmod +x "${prefPath}""${licenseFile}"
    /bin/echo "Setting permissions on ${prefPath}${licenseFile}..."
    /usr/sbin/chown root:wheel "${prefPath}""${licenseFile}"
fi</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.FontLab 7-Trial</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/FontLab 7.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
