<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of AirParrot 2-Trial and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.AirParrot 2-Trial</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AirParrot 2-Trial</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.AirParrot 2-Trial</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
