<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Jabra Direct.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Jabra Direct</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JabraDirect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://jabraxpressonlineprdstor\.blob\.core\.windows\.net/jdo/JabraDirectSetup.*?\.dmg</string>
                <key>url</key>
                <string>https://www.jabra.co.uk/software-and-services/jabra-direct</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: GN Audio AS (55LV32M29R)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/JabraDirectSetup.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>