<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of KeyStore Explorer and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.KeyStore Explorer</string>
    <key>Input</key>
    <dict>
        <key>BUNDLE_ID</key>
        <string>net.sf.keystoreexplorer</string>
        <key>NAME</key>
        <string>KeyStoreExplorer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.KeyStore Explorer</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
    </array>
</dict>
</plist>
