<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of EyeJack Creator 2024</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.EyeJack Creator 2024</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EyeJackCreator2024</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>EyeJack Creator (2024\S*\.dmg)</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://s3.amazonaws.com/eyejack-creator-2020/prd/mac/latest-mac.yml</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://s3.amazonaws.com/eyejack-creator-2020/prd/mac/EyeJack+Creator+%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/EyeJack Creator 2024.app</string>
                <key>requirement</key>
                <string>identifier "com.eyejackapp.creator" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "69N5JPMK3Q"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
