<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the trial version of Wondershare Video Converter Ultimate 10.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Wondershare Video Converter Ultimate 10-Trial</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WondershareVideoConverterUltimate10-Trial</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://cbs.wondershare.com/go.php?m=upgrade_info&amp;pid=967&amp;version=10</string>
				<key>re_pattern</key>
				<string>(http://download.wondershare.net/upgrade/video-converter-ultimate-mac_full[\S]+\.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
		<dict>
        	<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Wondershare Video Converter Ultimate.app</string>
                <key>requirement</key>
                <string>identifier "com.Wondershare.Video-Converter-Ultimate" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = YZC2T44ZDX</string>
            </dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
    </array>
</dict>
</plist>
