<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of MPEG Streamclip.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.MPEG Streamclip</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MPEGStreamclip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.squared5.com/svideo/mpeg-streamclip-mac.html</string>
                <key>re_pattern</key>
                <string>(http://www.alfanet.it/squared5/MPEG_Streamclip_+[0-9a-z\.]+\.[0-9a-z\.]+\.[0-9a-z\.]+\.dmg)</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
