<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the version of Apache NetBeans 11.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Apache NetBeans 11</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ApacheNetBeans11</string>
        <key>BASE_URL</key>
        <string>https://netbeans.apache.org</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%/download/archive/index.html</string>
                <key>re_pattern</key>
                <string>href="(/download/nb11[\d]+/nb11[\d]+.html)" class="button success">Download</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%%match%</string>
                <key>re_pattern</key>
                <string>href="(.*\/Apache-NetBeans-11\.[\d].*-bin-macosx\.dmg)"</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>   
			<key>Processor</key>   
			<string>CodeSignatureVerifier</string>   
			<key>Arguments</key>   
			<dict>   
				<key>input_path</key>   
				<string>%pathname%/Apache NetBeans 11.*.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: The Apache Software Foundation (2GLGAFWEQD)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>