<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of SAGA GIS.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.SAGA GIS</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SAGAGIS</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>"mac":[^}]*?"url":\s*"https?://downloads\.sourceforge\.net/project/saga-gis/(?P&lt;mac_path_encoded&gt;[^?]*?saga-(?P&lt;version&gt;[0-9]+(\.[0-9]+)+)_mac\.zip)\?</string>
                <key>url</key>
                <string>https://sourceforge.net/projects/saga-gis/best_release.json</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
                <key>url</key>
                <string>https://sourceforge.net/projects/saga-gis/files/%mac_path_encoded%/download</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
    </array>
</dict>
</plist>
