<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Recipe description</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.autopkg.download.tsh</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>tsh</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is none functioning and has been deprecated.

See: https://goteleport.com/blog/teleport-17/
    - Starting with version 17, Teleport no longer provides a separate tsh.pkg macOS package.
    - Instead, teleport.pkg and all macOS tarballs include signed and notarized tsh.app and tctl.app.

Recipes for Teleport can be found here: https://github.com/williamtheaker/autopkg-recipes/tree/master/Teleport</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://goteleport.com/docs/installation/#macos</string>
                <key>re_pattern</key>
                <string>href=(https://cdn\.teleport\.dev/tsh-([0-9]+(\.[0-9]+)+)\.pkg)</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Gravitational Inc. (QH8AA5B8UP)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
