<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Clevershare2.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Clevershare2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Clevershare2</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.clevertouch.com/uk/clevershare2g</string>
                <key>re_pattern</key>
                <string>(https://saharaplc\.s3\.eu-west-2\.amazonaws\.com/Clevershare.*/Clients/.*/Clevershare.*\.dmg)</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Clevershare.app</string>
                <key>requirement</key>
                <string>identifier "com.clevertouch.clevershare2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LHZP4ZQ39M</string>
                <key>strict_verification</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
