<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Clevershare 2 and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Clevershare2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Clevershare2</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Clevershare 2 is a bi-directional mirroring application that wirelessly connects your iPhone, iPad, Android phone and tablet, Mac, Windows laptop/PC and Chrome devices to your Clevertouch touch screen.</string>
            <key>developer</key>
            <string>Sahara</string>
            <key>display_name</key>
            <string>Clevershare 2</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash

# To stop admin credentials being asked for on Application launch unzip the MAXHUBAudio.driver to /Library/Audio/Plug-Ins/HAL

/usr/bin/unzip /Applications/Clevershare.app/Contents/Resources/MAXHUBAudio.driver.zip -d /Library/Audio/Plug-Ins/HAL/ -x __MACOSX/*

exit 0</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Clevershare2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
