<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Compass and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.Compass</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Compass</string>
        <key>PKG_ID</key>
        <string>com.MeyerSound.Compass</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Compass</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip/Compass Mac v%VERSION% build %BUILD% Release.dmg/Compass v%VERSION%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Compass</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>/</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                    </array>
                    <key>pkgname</key>
                    <string>%NAME%-%VERSION%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>pkgroot</key>
                    <string>%pkgroot%</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
