<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Compass and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Compass</string>
    <key>Input</key>
    <dict>
        <key>DERIVE_MIN_OS</key>
        <string>YES</string>
        <key>NAME</key>
        <string>Compass</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Compass is a comprehensive and intuitive way to control all the features and power offered by Galileo GALAXY and CAL.</string>
            <key>developer</key>
            <string>Newfangled Audio</string>
            <key>display_name</key>
            <string>Compass</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash

# Install the Layer 2 Communications Driver to prevent warning:
# "The Layer 2 Communications Driver is not installed. Without this driver,
# Compass will not be able to communicate via 1722.1, which means that CAL,
# RMS and AVB discovery will not work."

PKG_PATH="/Applications/Compass/Compass.app/Contents/Resources/Data/msliapi.pkg"

if [ -f "$PKG_PATH" ]; then
    echo "Found msliapi.pkg, installing..."
    /usr/sbin/installer -pkg "$PKG_PATH" -target /
    exit $?
else
    echo "msliapi.pkg not found, nothing to install."
    exit 0
fi</string>
            <key>postuninstall_script</key>
            <string>#!/bin/bash

# Remove the Layer 2 Communications Driver components installed by msliapi.pkg
# This removes LaunchDaemons, BPF group, and installed files

CHMOD_IDENTIFIER="com.meyersound.msliapi.chmodbpf"
CHMOD_LAUNCH_DAEMON_PLIST="/Library/LaunchDaemons/$CHMOD_IDENTIFIER.plist"
MCAST_IDENTIFIER="com.meyersound.msliapi.mcast"
MCAST_LAUNCH_DAEMON_PLIST="/Library/LaunchDaemons/$MCAST_IDENTIFIER.plist"
BPF_GROUP="access_bpf"
MSLIAPI_PATH="/Library/Meyer Sound/msliapi"

echo "Removing Layer 2 Communications Driver components..."

# Unload and remove LaunchDaemons
if [ -f "$CHMOD_LAUNCH_DAEMON_PLIST" ]; then
    echo "Unloading CHMOD LaunchDaemon..."
    /bin/launchctl unload "$CHMOD_LAUNCH_DAEMON_PLIST" 2&gt;/dev/null
    /bin/rm -f "$CHMOD_LAUNCH_DAEMON_PLIST"
fi

if [ -f "$MCAST_LAUNCH_DAEMON_PLIST" ]; then
    echo "Unloading MCAST LaunchDaemon..."
    /bin/launchctl unload "$MCAST_LAUNCH_DAEMON_PLIST" 2&gt;/dev/null
    /bin/rm -f "$MCAST_LAUNCH_DAEMON_PLIST"
fi

# Remove BPF group if it exists and has no other members
if /usr/bin/dscl . -read /Groups/"$BPF_GROUP" &gt; /dev/null 2&gt;&amp;1; then
    echo "Removing BPF group..."
    /usr/sbin/dseditgroup -q -o delete "$BPF_GROUP" 2&gt;/dev/null
fi

# Remove msliapi directory and contents
if [ -d "$MSLIAPI_PATH" ]; then
    echo "Removing msliapi directory..."
    /bin/rm -rf "$MSLIAPI_PATH"
fi

# Remove package receipt
/usr/sbin/pkgutil --forget com.meyersound.msliapi.chmodbpf 2&gt;/dev/null

echo "Layer 2 Communications Driver components removed."
exit 0</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.Compass</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%VERSION%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%VERSION%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unzip</string>
                    <string>%RECIPE_CACHE_DIR%/Pkgroot</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
