<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Max 8.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Max 8</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Max 8</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cycling74.com/_next/static/chunks/pages/thanks-for-downloading-max-e277ddb83654f055.js</string>
                <key>re_pattern</key>
                <string>([A-Za-z0-9]+-maxmspjitter\.s3\.amazonaws\.com)</string>
                <key>result_output_var_name</key>
                <string>BASE_URL</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cycling74.com/_next/static/chunks/pages/thanks-for-downloading-max-e277ddb83654f055.js</string>
                <key>re_pattern</key>
                <string>version:"(\d)\.\d\.\d"</string>
                <key>result_output_var_name</key>
                <string>VERSION_1</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cycling74.com/_next/static/chunks/pages/thanks-for-downloading-max-e277ddb83654f055.js</string>
                <key>re_pattern</key>
                <string>version:"\d\.(\d)\.\d"</string>
                <key>result_output_var_name</key>
                <string>VERSION_2</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cycling74.com/_next/static/chunks/pages/thanks-for-downloading-max-e277ddb83654f055.js</string>
                <key>re_pattern</key>
                <string>version:"\d\.\d\.(\d)"</string>
                <key>result_output_var_name</key>
                <string>VERSION_3</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cycling74.com/_next/static/chunks/pages/thanks-for-downloading-max-e277ddb83654f055.js</string>
                <key>re_pattern</key>
                <string>m=\{date:r\(\)\(\"\d\d-\d\d-20(\d\d)\",\"MM-DD-YYYY\"\)</string>
                <key>result_output_var_name</key>
                <string>YEAR</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cycling74.com/_next/static/chunks/pages/thanks-for-downloading-max-e277ddb83654f055.js</string>
                <key>re_pattern</key>
                <string>m=\{date:r\(\)\(\"(\d\d)-\d\d-20\d\d\",\"MM-DD-YYYY\"\)</string>
                <key>result_output_var_name</key>
                <string>MONTH</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cycling74.com/_next/static/chunks/pages/thanks-for-downloading-max-e277ddb83654f055.js</string>
                <key>re_pattern</key>
                <string>m=\{date:r\(\)\(\"\d\d-(\d\d)-20\d\d\",\"MM-DD-YYYY\"\)</string>
                <key>result_output_var_name</key>
                <string>DAY</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%/Max%VERSION_1%%VERSION_2%%VERSION_3%_%YEAR%%MONTH%%DAY%.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Max.app</string>
                <key>requirement</key>
                <string>identifier "com.cycling74.Max" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GBXXCFCVW5</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
