<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Max 8.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Max 8</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Max 8</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cycling74.com/thanks-for-downloading-max/?os=mac</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https://\w*-maxmspjitter.s3.amazonaws.com/Max8\S.*.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Max.app</string>
                <key>requirement</key>
                <string>identifier "com.cycling74.Max" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GBXXCFCVW5</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
