<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for FlashPrint.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.FlashPrint</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FlashPrint</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Following the release of Flash Print 5, these recipes no longer work. For FlashPrint 5 recipes please see: https://github.com/autopkg/dataJAR-recipes/tree/master/FlashPrint%205.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.flashforge.com/download-center?category=15</string>
                <key>re_pattern</key>
                <string>mac.*\n.*\n.*\n.*\n.*\n.*\n.*\n.*(https:\S*zip)</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/downloads</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
