<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest LXFree installer in a disk image.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.LXFree</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LXFree</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.claudeheintzdesign.com/downloads/lxfree_install.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>curl_opts</key>
                <array>
                    <string>--location</string>
                    <string>--retry</string>
                    <string>3</string>
                    <string>--retry-delay</string>
                    <string>5</string>
                    <string>--max-time</string>
                    <string>300</string>
                    <string>--connect-timeout</string>
                    <string>30</string>
                    <string>--keepalive-time</string>
                    <string>300</string>
                    <string>--compressed</string>
                </array>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>curl/7.79.1</string>
                    <key>Accept</key>
                    <string>*/*</string>
                    <key>Connection</key>
                    <string>keep-alive</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install LXFree.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Claude Heintz Design (T95243XU48)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
