<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads LFXFree Disk image and extracts the embedded package. No repackaging done.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.LXFree</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LXFree</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.claudeheintzdesign.com/downloads/lxfree_install.dmg</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_2) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0.2 Safari/605.1.15</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.LXFree</string>
    <key>Process</key>
    <array>
	<dict>
		<key>Processor</key>
        <string>FlatPkgUnpacker</string>
        <key>Arguments</key>
        <dict>
           <key>flat_pkg_path</key>
           <string>%pathname%/Install LXFree.pkg</string>
           <key>destination_path</key>
           <string>%RECIPE_CACHE_DIR%/unpack</string>
        </dict>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>pkg_payload_path</key>
            <string>%RECIPE_CACHE_DIR%/unpack/lxfree.pkg/Payload</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/unpack/root</string>
        </dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
    </dict>    
    <dict>
    	<key>Arguments</key>
        <dict>
            <key>info_path</key>
            <string>%RECIPE_CACHE_DIR%/unpack/root/Applications/LXSeries/%NAME%.app/Contents/Info.plist</string>
            <key>plist_keys</key>
            <dict>
				<key>CFBundleShortVersionString</key>
				<string>version</string>
			</dict>
		</dict>
        <key>Processor</key>
        <string>PlistReader</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>source_pkg</key>
            <string>%pathname%/Install LXFree.pkg</string>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
        <key>Processor</key>
        <string>PkgCopier</string>
    </dict>
    </array>
</dict>
</plist>