<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Adobe Camera Raw.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Adobe Camera Raw</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeCameraRaw</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://www\.adobe\.com/go/acr_installer_mac</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://helpx.adobe.com/uk/camera-raw/kb/camera-raw-plug-in-installer.html</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Adobe Inc. (JQ525L2MZD)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/CameraRaw*.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
