<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of UltraEdit.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.UltraEdit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UltraEdit</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(https://downloads\.ultraedit\.com/main/ue/mac/UltraEdit\.dmg)\"</string>
                <key>url</key>
                <string>https://www.ultraedit.com/downloads/uex-thank-you/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/UltraEdit.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.idmcomp.uex" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2T4C9Y59FF")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>