<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Swiss-PdbViewer and extracts the Pkg</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Swiss-PdbViewer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Swiss-PdbViewer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://spdbv.vital-it.ch/disclaim.html#</string>
				<key>re_pattern</key>
				<string>SPDBV_+[0-9]+\.+[0-9]+\.+[0-9]+\_OSX.zip</string>
			</dict>
		</dict>
        <dict>
        	<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://spdbv.vital-it.ch/download/binaries/%match%</string>
				<key>filename</key>
                <string>%NAME%.zip</string>
			</dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/SPDBV_*_OSX/Swiss-PdbViewer.app</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%found_filename%/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
    </array>
</dict>
</plist>