<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of AVBridge.

To download Apple Silicon use: "-arm64" in the DOWNLOAD_ARCH variable
To download Intel leave the DOWNLOAD_ARCH variable empty</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.AVBridge</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AVBridge</string>
        <key>DOWNLOAD_ARCH</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>version: (\d(\.\d)+)</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_VERSION</string>
                <key>url</key>
                <string>https://www.banyan-av.com/download/avbridge/latest.yml</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://www.banyan-av.com/download/avbridge/AVBridge-%DOWNLOAD_VERSION%%DOWNLOAD_ARCH%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/AVBridge.app</string>
                <key>requirement</key>
                <string>identifier "com.banyan-av.avbridge" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LRNWZB2D4D</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
