<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of FlashPrint 5.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.FlashPrint 5</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FlashPrint</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>comment</key>
                <string>Because the macOS link is an image with no usable text, we're matching the SECOND instance of a zip file link on the page. If the macOS image link moves position relative to the Windows image link, this may need to be adjusted.</string>
                <key>re_pattern</key>
                <string>(?:https://en\.fss\.flashforge\.com/10000/software/[0-9a-f]+\.zip).*(https://en\.fss\.flashforge\.com/10000/software/[0-9a-f]+\.zip)</string>
                <key>url</key>
                <string>https://enterprise.flashforge.com/pages/flashprint</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
