<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of TI Connect CE.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.TI Connect CE</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TI Connect CE</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
         <dict>
        <key>Arguments</key>
        <dict>
            <key>re_pattern</key>
            <string>href="(/download/en/ed-tech/.*/.*/TIConnectCE.*\.dmg)"</string>
            <key>url</key>
            <string>https://education.ti.com/en-GB/software/details/en/CA9C74CAD02440A69FDC7189D7E1B6C2/swticonnectcesoftware</string>
            <key>result_output_var_name</key>
            <string>version</string>
         </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
            <string>https://education.ti.com/%version%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/TI Connect CE.app</string>
                <key>requirement</key>
                <string>identifier "com.ti.et.elg.tiConnect.TIConnectApplication" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TLEVLB8B5D</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
