<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for UPDD Commander.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.UPDD Commander</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UPDDCommander</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.legamaster.com/downloads/software</string>
                <key>re_pattern</key>
                <string>href=\"/(fileadmin/user_upload/Software/All_in_one_Mac_Driver/Legamaster_all_in_one_UPDD_([0-9]+(_[0-9]+)+)\.zip)\">Download macOS all in one driver</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.legamaster.com/%match%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unzip/UPDD*.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%/Install UPDD.app</string>
                <key>requirement</key>
                <string>identifier "com.touch-base.install-updd" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = U86H28HG4S</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
