<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Traffic.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Traffic</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Traffic</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://traffic-live-dist.s3.amazonaws.com/update_2_5.xml</string>
				<key>re_pattern</key>
				<string>((\S+)\.air)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>TrafficApplication-Installer.air</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/TrafficApplication-Installer.air</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/TrafficApplication-Installer.zip</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/TrafficApplication-Installer.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>TrafficXMLParser</string>
			<key>Arguments</key>
			<dict>
				<key>app_xml</key>
				<string>%destination_path%/META-INF/AIR/application.xml</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unzip</string>     
                    <string>%archive_path%</string> 
                </array>
            </dict>
        </dict> 
    </array>
</dict>
</plist>
