<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Inquisit 4 Lab and imports into jss.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.jss.Inquisit 4 Lab</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Development</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Inquisit 4 Lab</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Inquisit 4 Lab Lab is a powerful tool for designing, testing, debugging, demonstrating, and administering psychological tests and experiments. Inquisit 4 Lab Lab is capable of collecting rich behavioral data from a wide variety of measures used in the fields of cognitive neuroscience, cognitive, social, and personality psychology, consumer behavior, behavioral economics, and neuropsychology. Inquisit Lab is designed to be run on dedicated computers within research labs, classrooms, kiosks, and on mobile laptops taken out into the field.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Inquisit4.png</string>
	</dict>
  	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Inquisit 4 Lab</string>
	<key>Process</key>
	<array>
	    <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%flat_pkg_path%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
