<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of JAGS: Just Another Gibbs Sampler</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.autopkg.download.JAGS</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JAGS</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(JAGS-([0-9]+(\.[0-9]+)+)\.pkg)</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_NAME</string>
                <key>url</key>
                <string>https://sourceforge.net/projects/mcmc-jags/files/JAGS/4.x/Mac%20OS%20X/</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://sourceforge.net/projects/mcmc-jags/files/JAGS/4.x/Mac%20OS%20X/%DOWNLOAD_NAME%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>input_path</key>
            <string>%pathname%</string>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Matthew Denwood (5SKYAC3SYX)</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
