<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Firefox ESR release

Set the 'LOCALE' variable to the required language version.
Set the 'OS_TYPE' variable to the required Operating Systems.

List of available locale codes and supported Operating Systems here: https://releases.mozilla.org/pub/firefox/releases/latest-esr/README.txt</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Firefox ESR</string>
    <key>Input</key>
    <dict>
        <key>LOCALE</key>
        <string>en-US</string>
        <key>OS_TYPE</key>
        <string>os=osx</string>
        <key>NAME</key>
        <string>FirefoxESR</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.mozilla.org/?product=firefox-esr-latest&amp;%OS_TYPE%&amp;lang=%LOCALE%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Firefox.app</string>
                <key>requirement</key>
                <string>anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "43AQ936H96"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
