<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Superhuman.

To download Apple Silicon use: "-arm64" in the DOWNLOAD_ARCH variable
To download Intel leave DOWNLOAD_ARCH empty</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Superhuman</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_ARCH</key>
        <string></string>
        <key>NAME</key>
        <string>Superhuman</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://assets.mail.superhuman.com/webapp/download/Superhuman%DOWNLOAD_ARCH%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Superhuman.app</string>
                <key>requirement</key>
                <string>identifier "com.superhuman.electron" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6XHFYUTQGX"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
