<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of ShareFile Desktop</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.ShareFile Desktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ShareFileDesktop</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://dl.sharefile.com/sfdesktopmac/updates.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This title has been replaced with Citrix Files for Mac, as such please use: https://github.com/autopkg/dataJAR-recipes/tree/master/Citrix%20Files%20for%20Mac </string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
	</array>
</dict>
</plist>
