<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Sound Particles 3 and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Sound Particles 3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SoundParticles3</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Say hello to Sound Particles 3, your new playground for bold ideas, massive scale, and mind-bending sound design. Whether crafting cinematic soundscapes, sculpting immersive environments, or pushing the limits of audio in music, games, or film — Sound Particles 3 lets you multiply, move, randomize, and render sounds in ways no other tool can.</string>
            <key>developer</key>
            <string>Sound Particles</string>
            <key>display_name</key>
            <string>Sound Particles 3</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash


# Removes Sound Particles application and support files

set -e  # Exit on any error

readonly APP_NAME="Sound Particles 3"
readonly APP_PATH="/Applications/Sound Particles 3.app"
readonly SUPPORT_PATH="/Library/Application Support/Sound Particles"

echo "Starting ${APP_NAME} uninstallation..."

# Remove application support directory
if [[ -d "$SUPPORT_PATH" ]]; then
    echo "Removing application support files..."
    rm -rf "$SUPPORT_PATH"
    echo "Application support files removed"
else
    echo "Application support directory not found"
fi

# Remove application bundle
if [[ -d "$APP_PATH" ]]; then
    echo "Removing application..."
    rm -rf "$APP_PATH"
    echo "Application removed"
else
    echo "Application not found"
fi

echo "${APP_NAME} uninstalled successfully."</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Sound Particles 3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
