<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Kinoni EpocCam Drivers.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Kinoni EpocCam Drivers</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KinoniEpocCamDrivers</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(https://edge\.elgato\.com/egc/macos/epoccam/EpocCam_Installer_([0-9]+(_[0-9]+)+)\.pkg)\"</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
                    <key>Referer</key>
                    <string>https://help.elgato.com/;auto</string>
                    <key>Sec-Fetch-Site</key>
                    <string>same-site</string>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>navigate</string>
                    <key>Sec-Fetch-Dest</key>
                    <string>document</string>
                </dict>
                <key>url</key>
                <string>https://help.elgato.com/hc/en-us/articles/360052826852-EpocCam-Release-Notes-macOS</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Corsair Memory, Inc. (Y93VXCB8Q5)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
