<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of OpenJDK and builds a package.</string>
        <key>Identifier</key>
      <string>com.github.dataJAR-recipes.pkg.OpenJDK</string>
        <key>Input</key>
        <dict>
        <key>NAME</key>
         <string>OpenJDK</string>
        </dict>
        <key>ParentRecipe</key>
      <string>com.github.dataJAR-recipes.download.OpenJDK</string>
        <key>MinimumVersion</key>
      <string>1.0.0</string>
        <key>Process</key>
        <array>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
               <string>%pkgroot%/Library/Java/JavaVirtualMachines/jdk*/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
               <string>%found_filename%</string>
                <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/preinstall</string>
                <key>file_mode</key>
               <string>0755</string>
                <key>file_content</key>
               <string>#!/bin/bash

# Remove existing OpenJDK %version% installation

version_number="%version%"
java_directory="$3/Library/Java/JavaVirtualMachines/jdk-$version_number.jdk"

if [[ -d "$java_directory" ]]; then
  rm -rf "$java_directory"
fi

exit 0</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                  <string>OpenJDK-%version%</string>
                    <key>version</key>
                  <string>%version%</string>
                    <key>id</key>
                  <string>net.java.openjdk</string>
                    <key>scripts</key>
                  <string>Scripts</string>
                    <key>chown</key>
                    <array>
                    <dict>
                        <key>path</key>
                        <string>Library</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                    </dict>
                    <dict>
                        <key>path</key>
                        <string>Library/Java</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                    </dict>
                    <dict>
                        <key>path</key>
                        <string>Library/Java/JavaVirtualMachines</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                    </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        </array>
    </dict>
</plist>
