<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest trial version of Any Video Converter Free for Mac.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Any Video Converter Free for Mac</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AnyVideoConverter</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://www.any-video-converter.com/products/mac_video_converter_freeware/su_feed_sl.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Any Video Converter.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.any.videoconverter.converter" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2PZNZ55XW6")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
