<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest trial version of Any Video Converter Free for Mac.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Any Video Converter Free for Mac</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AnyVideoConverter</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://dl.any-video-converter.com/files/mac/avc/avc/anvsoft/anvsoft-avc.zip</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://www.any-video-converter.com/update/avc_free_mac/latest-mac.yml</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
       <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Any Video Converter.app</string>
                <key>requirement</key>
                <string>identifier "com.anvsoft.avc" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2PZNZ55XW6"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
