<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of NaturalReader 16.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-test-recipes.download.NaturalReader 16</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NaturalReader16</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\(\"(https://wwwnaturalreaderscom\.s3\.amazonaws\.com/software/naturalreader16\.pkg)\"\)</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://www.naturalreaders.com/comfiles/software/js/software.js?v=230577</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>   
			<key>Processor</key>   
			<string>CodeSignatureVerifier</string>   
			<key>Arguments</key>   
			<dict>   
				<key>input_path</key>   
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: NaturalSoft (ZNEVFT9THT)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
