<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ADSK Licensing.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.ADSK Licensing</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ADSKLicensing</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>adsklicensinginstaller-mac-([0-9]+(.[0-9]+)+).tar.gz</string>
                <key>request_headers</key>
                <dict>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Accept-Language</key>
                    <string>en-US,en;q=0.9</string>
                    <key>Sec-Fetch-Dest</key>
                    <string>document</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>navigate</string>
                    <key>Sec-Fetch-Site</key>
                    <string>none</string>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.4 Safari/605.1.15</string>
                </dict>
                <key>result_output_var_name</key>
                <string>VERSION</string>
                <key>url</key>
                <string>https://www.autodesk.com/support/technical/article/caas/tsarticles/ts/f5IhBc15i0kOwzBb8lcEN.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.tar.gz</string>
                <key>request_headers</key>
                <dict>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Accept-Language</key>
                    <string>en-US,en;q=0.9</string>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.4 Safari/605.1.15</string>
                </dict>
                <key>url</key>
                <string>https://damassets.autodesk.net/content/dam/autodesk/www/files/adsklicensinginstaller-mac-%VERSION%.tar.gz</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Autodesk (XXKJ396S2Y)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/adsklicensinginstaller/AdskLicensing-%VERSION%-mac-installer.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
