<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Azeus Convene.

To download the Intel version set ARCH_TYPE to "v"
To download the Apple Silicon version set ARCH_TYPE to "aarch64.v"</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Azeus Convene</string>
    <key>Input</key>
    <dict>
        <key>ARCH_TYPE</key>
        <string>v</string>
        <key>NAME</key>
        <string>AzeusConvene</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>Latest Version: v([0-9]+(\.[0-9]+)+)</string>
                <key>request_headers</key>
                <dict>
                    <key>Referer</key>
                    <string>https://www.azeusconvene.com/downloads;auto</string>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.1.2 Safari/605.1.15</string>
                </dict>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_VERSION</string>
                <key>url</key>
                <string>https://www.azeusconvene.com/downloads</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>request_headers</key>
                <dict>
                    <key>Referer</key>
                    <string>https://www.azeusconvene.com/downloads;auto</string>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.1.2 Safari/605.1.15</string>
                </dict>
                <key>url</key>
                <string>https://www.azeusconvene.com/installers/macos/standard/Azeus%20Convene.%ARCH_TYPE%%DOWNLOAD_VERSION%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Azeus Systems Holdings Ltd. (W7ZT6WJ2PP)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/Convene Installer.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
