<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of FabFilter Pro-Q 4 and imports into Munki

Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.munki.FabFilter Pro-Q 4</string>
        <key>Input</key>
        <dict>
            <key>DERIVE_MIN_OS</key>
            <string>YES</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>FabFilterPro-Q4</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>High-quality equalizer plug-in</string>
                <key>developer</key>
                <string>FabFilter</string>
                <key>display_name</key>
                <string>FabFilter Pro-Q 4</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>2.7</string>
        <key>ParentRecipe</key>
        <string>com.github.dataJAR-recipes.download.FabFilter Pro-Q 4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                    <key>source_pkg</key>
                    <string>%pathname%/*.pkg</string>
                </dict>
                <key>Processor</key>
                <string>PkgCopier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                    <key>flat_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked/*.pkg</string>
                </dict>
                <key>Processor</key>
                <string>FileFinder</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/Library</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked/%found_basename%/Payload</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>find</key>
                    <string> </string>
                    <key>input_string</key>
                    <string>file://localhost/%RECIPE_CACHE_DIR%/unpacked/Distribution</string>
                    <key>replace</key>
                    <string>%20</string>
                </dict>
                <key>Processor</key>
                <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>os-version min=&quot;([0-9]+(\.[0-9]+)+)&quot;</string>
                    <key>result_output_var_name</key>
                    <string>min_os_ver</string>
                    <key>url</key>
                    <string>%output_string%</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                 <key>Arguments</key>
                 <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>minimum_os_version</key>
                        <string>%min_os_ver%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>derive_minimum_os_version</key>
                    <string>%DERIVE_MIN_OS%</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Library/Application Support/Avid/Audio/Plug-Ins/FabFilter Pro-Q 4.aaxplugin</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
            <key>Arguments</key>
            <dict>
                <key>changes</key>
                <array>
                    <dict>
                        <key>path</key>
                        <string>/Library/Application Support/Avid/Audio/Plug-Ins/FabFilter Pro-Q 4.aaxplugin</string>
                        <key>CFBundleIdentifier</key>
                        <string>com.fabfilter.Pro-Q.AAX.4</string>
                    </dict>
                </array>
            </dict>
            <key>Processor</key>
            <string>com.github.dataJAR-recipes.Shared Processors/InstallsArrayCFBundleIdentifierChanger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/Library/Application Support/Avid/Audio/Plug-Ins/FabFilter Pro-Q 4.aaxplugin/Contents/Info.plist</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/unpacked</string>
                        <string>%RECIPE_CACHE_DIR%/Library</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>
</plist>
