<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Malwarebytes 3 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.munki.Malwarebytes 3</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Malwarebytes</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Proven Malwarebytes technology crushes the growing threat of Mac malware.
So you are protected and your machine keeps running silky smooth.
Finally, cybersecurity smart enough for the Mac.</string>
			<key>developer</key>
			<string>Malwarebytes</string>
			<key>display_name</key>
			<string>Malwarebytes</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Malwarebytes 3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Malwarebytes.app</string>
					<string>/Library/Extensions/com.malwarebytes.mbam.rtprotection.kext</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/uninstaller_unpack/</string>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/installer_payload/Library/Application Support/Malwarebytes/MBAM/Engine.bundle/Contents/Resources/Remove_Malwarebytes.pkg</string>
				<key>purge_destination</key>
				<string>true</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/uninstaller_unpack/Uninstaller.pkg/Scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--uninstall_script=%found_filename%</string>
				</array>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/installer-pkg/Malwarebytes.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                	<string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                	<string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
                	<string>%RECIPE_CACHE_DIR%/uninstaller_unpack/</string>                                    
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict> 
	</array>
</dict>
</plist>
