<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Malwarebytes 3.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Malwarebytes 3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Malwarebytes</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The v3 url (https://downloads.malwarebytes.com/file/mb3-mac) now downloads v4, as such these recipes are not needed and can be replaced with: https://github.com/autopkg/homebysix-recipes/tree/master/Malwarebytes.</string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
        	<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://downloads.malwarebytes.com/file/mb3-mac</string>
				<key>filename</key>
    			<string>Malwarebytes.pkg</string>
    			<key>download_dir</key>
    			<string>%RECIPE_CACHE_DIR%/downloads/installer-pkg</string>
			</dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Malwarebytes Corporation (GVZRY6KDKR)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<string>true</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/installer_payload/</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/installer_unpack/MBAM.pkg/Payload</string>
				<key>purge_destination</key>
				<string>true</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/installer_payload/Applications/Malwarebytes.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>       
    </array>
</dict>
</plist>
