<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Jamf Connect Login for Okta and imports it in into Munki.

The name "okta" needs to be present in the PKG name, this is case insensitive.

https://docs.jamf.com/jamf-connect/1.18.0/administrator-guide/Deploying_Jamf_Connect_Login.html
</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Jamf Connect Login Okta</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Jamf Connect Login Okta</string>
        <key>NAME</key>
        <string>JamfConnectLoginOkta</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Jamf Connect Login (formerly NoMAD Login+) is an application that allows you to manage authentication with the macOS loginwindow process.</string>
            <key>developer</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe has been deprecated following the release of Jamf Connect 2.0</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
    </array>
</dict>
</plist>
