<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of VMware Fusion 11.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.VMware Fusion 11</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>Comment</key>
                <string>Example for 11.x: https://my.vmware.com/channel/public/api/v1.0/products/getRelatedDLGList?locale=en_US&amp;category=desktop_end_user_computing&amp;product=vmware_fusion&amp;version=11_0&amp;dlgType=PRODUCT_BINARY</string>
                <key>re_pattern</key>
                <string>{\"name\":\"VMware Fusion 11.*\",\"dlgList\":\[{\".*\",\"code\":\"(?P&lt;downloadGroup&gt;FUS-\d.*)\",\"releaseDate\":\".*\",\"productId\":\".*\",\"releasePackageId\":\".*\",\"isFirmwareImage\":.*,\"orderId\":.*}</string>
                <key>url</key>
                <string>https://my.vmware.com/channel/public/api/v1.0/products/getRelatedDLGList?locale=en_US&amp;category=desktop_end_user_computing&amp;product=vmware_fusion&amp;version=11_0&amp;dlgType=PRODUCT_BINARY</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>Comment</key>
                <string>Example for 11.x: https://my.vmware.com/channel/public/api/v1.0/dlg/details?locale=en_US&amp;category=desktop_end_user_computing&amp;product=vmware_fusion&amp;version=11_0&amp;dlgType=PRODUCT_BINARY&amp;downloadGroup=FUS-1155</string>
                <key>re_pattern</key>
                <string>VMware-Fusion-.*\.dmg</string>
                <key>result_output_var_name</key>
                <string>dmg_url</string>
                <key>url</key>
                <string>https://my.vmware.com/channel/public/api/v1.0/dlg/details?locale=en_US&amp;category=desktop_end_user_computing&amp;product=vmware_fusion&amp;version=11_0&amp;dlgType=PRODUCT_BINARY&amp;downloadGroup=%downloadGroup%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>Comment</key>
                <string>Example for 11.x: https://download3.vmware.com/software/fusion/file/VMware-Fusion-11.5.5-16269456.dmg</string>
                <key>url</key>
                <string>https://download3.vmware.com/software/fusion/file/%dmg_url%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/VMware Fusion.app</string>
                <key>requirement</key>
                <string>identifier "com.vmware.fusion" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EG7KH642X6</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
