<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Egnyte Desktop Sync.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Egnyte Desktop Sync NoPrefs</string>
    <key>Input</key>
    <dict>
        <key>LOCALE</key>
        <string>en-us</string>
        <key>NAME</key>
        <string>Egnyte Desktop Sync</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>From: https://helpdesk.egnyte.com/hc/en-us/articles/201636844 "IMPORTANT NOTICE: Desktop Sync is no longer supported as of December 31st, 2019. Click here to see how you can start using the Desktop App today." A .munki recipe for the replacement app can be found at - https://github.com/autopkg/dataJAR-recipes/tree/master/Egnyte%20Connect, with download and pkg recipes at - https://github.com/autopkg/moofit-recipes/tree/master/Egnyte</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://egnyte-cdn.egnyte.com/desktopsync/mac/en-us/\d.*/EgnyteDesktopSync_\S.*.pkg</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://helpdesk.egnyte.com/hc/%LOCALE%/articles/201636844</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Egnyte Inc (FELUD555VC)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
