<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Egnyte Desktop Sync package and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.munki.Egnyte Desktop Sync NoPrefs</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Egnyte Desktop Sync</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Applications</string>
			<key>developer</key>
			<string>Egnyte</string>
			<key>description</key>
			<string>Keep a local copy of files on your Egnyte cloud storage using this desktop sync agent.</string>
			<key>display_name</key>
			<string>Egnyte Desktop Sync</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Egnyte Desktop Sync NoPrefs</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
