<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Zinio Reader.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Zinio Reader</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ZinioReader</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cdn-web.zinio.com/ZinioReader/prd/manifest.json</string>
                <key>re_pattern</key>
                <string>ZinioReader/prd/[\S]+\/ZinioReader_[\S]+\.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cdn-web.zinio.com/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Zinio Reader.app</string>
                <key>requirement</key>
                <string>identifier "com.nw-builder.zinioreader" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HXRR8JDUMK</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
