<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of RemotePCViewer.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.RemotePCViewer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RemotePCViewer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>MAC_VIEWER_SETUP_DOWNLOAD_URL=\"(https://static\.remotepc\.com/downloads/rpc/.*/RemotePCViewer\.dmg)\"</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://static.remotepc.com/downloads/version_mac.js</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: IDrive Incorporated (JWDCNYZ922)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/RemotePCViewer.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>