<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of EV3Classroom and imports into Munki</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.EV3 Classroom</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EV3Classroom</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>EV3 Classroom</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>If you have any LEGO MINDSTORMS Education EV3 product and want to program your EV3 Brick with word block coding, download the LEGO MINDSTORMS Education EV3 Classroom App.</string>
            <key>developer</key>
            <string>The LEGO Group</string>
            <key>display_name</key>
            <string>EV3 Classroom</string>
            <key>minimum_os_version</key>
            <string>10.14</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.EV3 Classroom</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
