<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of EV3 Classroom</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.EV3 Classroom</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EV3Classroom</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(https://assets\.education\.lego\.com/_/downloads/EV3_([0-9]+(\.[0-9]+)+)_Global\.dmg)</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://education.lego.com/page-data/en-us/downloads/mindstorms-ev3/software/page-data.json</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/EV3Classroom.app</string>
                <key>requirement</key>
                <string>identifier "com.lego.ev3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9YZJD9MXPZ"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
