<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Transcribe!.

To download the x86_64 version use "intel" in the DOWNLOAD_ARCH variable.
To download the arm64 version use "arm" in the DOWNLOAD_ARCH variable.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Transcribe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Transcribe!</string>
        <key>DOWNLOAD_ARCH</key>
        <string>intel</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(downmo/transcribe-%DOWNLOAD_ARCH%-([0-9]+(\.[0-9]+)+)\.dmg)\"</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://www.seventhstring.com/xscribe/download_mac.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://www.seventhstring.com/xscribe/%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Transcribe!.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.seventhstring.transcribe" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = BLF9LDX5CW)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
