<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Comment</key>
        <string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
        <key>Description</key>
        <string>Downloads the latest version of Up Studio.</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.UP Studio</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Up Studio</string>
        </dict>
        <key>MinimumVersion</key>
        <string>2.3</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>https://static\.tiertime\.com/downloads/mac/UpStudio_V\d+\.dmg</string>
                    <key>result_output_var_name</key>
                    <string>url</string>
                    <key>url</key>
                    <string>https://www.tiertime.com/software/</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <key>Comment</key>
            <string>Code signature verification temporarily disabled due to expired Apple certificate in signing chain. &lt;dict&gt; &lt;key&gt;Arguments&lt;/key&gt; &lt;dict&gt; &lt;key&gt;input_path&lt;/key&gt; &lt;string&gt;%pathname%/Up Studio.app&lt;/string&gt; &lt;key&gt;requirement&lt;/key&gt; &lt;string&gt;(anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = &quot;2HU95337PZ&quot;) and identifier &quot;com.tiertime.upStudio&quot;&lt;/string&gt; &lt;/dict&gt; &lt;key&gt;Processor&lt;/key&gt; &lt;string&gt;CodeSignatureVerifier&lt;/string&gt; &lt;/dict&gt;</string>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%pathname%/Up Studio.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
        </array>
    </dict>
</plist>
