<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Post Haste.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Post Haste</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_CHECK_URL</key>
        <string>https://www.digitalrebellion.com/posthaste/download-mac</string>
        <key>NAME</key>
        <string>Post Haste</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>Downloading Post Haste for Mac.*/download\/posthaste\?version=(.*)\"&gt;click</string>
                <key>url</key>
                <string>%DOWNLOAD_CHECK_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://digitalrebellion-downloads.s3.amazonaws.com/posthaste/Post_Haste_for_Mac_%match%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Post Haste.app</string>
                <key>requirement</key>
                <string>identifier "com.digitalrebellion.PostHaste" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7F8QJ989JE"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
