<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of FLEXOPTIX App.

To download Apple Silicon use: "arm64" in the DOWNLOAD_ARCH variable
To download Intel use: "x64" in the DOWNLOAD_ARCH variable</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.FLEXOPTIX App</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_ARCH</key>
        <string>x64</string>
        <key>NAME</key>
        <string>FLEXOPTIXApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://flexbox.reconfigure.me/download/electron/mac/%DOWNLOAD_ARCH%/current</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/FLEXOPTIX App.app</string>
                <key>requirement</key>
                <string>identifier "net.flexoptix.flexoptix.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C5JETSFPHL</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
