<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of FLEXOPTIX App.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.FLEXOPTIX App</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FLEXOPTIXApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https.*flexbox\.reconfigure\.me.*download.*electron.*mac.*current</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://www.flexoptix.net/en/flexoptix-app/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.dataJAR-recipes.Shared Processors/HTMLUnescaper</string>
            <key>Arguments</key>
            <dict>
                <key>input_string</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%unescaped_string%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/FLEXOPTIX App.app</string>
                <key>requirement</key>
                <string>identifier "net.flexoptix.flexoptix.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C5JETSFPHL</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>