<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Gladinet Cloud Drive Mac Client 9</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Gladinet Cloud Drive Mac Client 9</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Gladinet Cloud Drive Mac Client 9</string>
        <key>SEARCH_URL</key>
        <string>https://www.centrestack.com/management1/releases/latestdownloads.aspx</string>
        <key>SEARCH_PATTERN</key>
        <string>https://s3\.amazonaws\.com/gladinetsupport/.*?/gladinet/MacClient\.8_.*?\.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Cloud Drive.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Gladinet, Inc. (CX8U2YJ96P)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>