<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of CrashPlan.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.CrashPlan</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>CrashPlan</string>
		<key>DOWNLOAD_URL</key>
		<string>https://download.code42.com/installs/agent/latest-mac.dmg</string>
		<key>NAME</key>
		<string>CrashPlan</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Please use the Code42 recipes instead.</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
