<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ZinioWebReader.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.ZinioWebReader</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ZinioWebReader</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https:\/\/www\.zinio\.com\/static\/assets\/desktop-app\/([0-9]+(_[0-9]+)+)\/ZinioDesktopReaderSetup\.dmg</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://www.zinio.com/gb/desktop/reader</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://www.zinio.com/static/assets/desktop-app/%version%/ZinioDesktopReaderSetup.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/ZinioWebReader.app</string>
                <key>requirement</key>
                <string>identifier "com.electron.nativefier.ziniowebreader-nativefier-ae9ded" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = NXAX6MA6VD</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
