<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Aspera Connect.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Aspera Connect</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AsperaConnect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(bin/ibm-aspera-connect_([0-9]+(\.[0-9]+)+)-HEAD_macOS_x86_64\.pkg)</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://d3gcli72yxqn2z.cloudfront.net/downloads/connect/latest/references.json</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>bin/ibm-aspera-connect_([0-9]+(\.[0-9]+)+)-HEAD_macOS_x86_64\.pkg</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://d3gcli72yxqn2z.cloudfront.net/downloads/connect/latest/references.json</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://d3gcli72yxqn2z.cloudfront.net/downloads/connect/latest/%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: International  Business Machines Corp (PETKK2G752)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
