<?xml version="1.0" encoding="UTF-8"?>
 <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
 <plist version="1.0">
 <dict>
     <key>Description</key>
     <string>Downloads the latest version of Aspera Connect and imports it into Munki.</string>
     <key>Identifier</key>
     <string>com.github.dataJAR-recipes.munki.Aspera Connect</string>
     <key>Input</key>
     <dict>
         <key>NAME</key>
         <string>Aspera Connect</string>
         <key>MUNKI_REPO_SUBDIR</key>
         <string>apps/%NAME%</string>
         <key>pkginfo</key>
         <dict>
             <key>catalogs</key>
             <array>
                 <string>testing</string>
             </array>
             <key>description</key>
             <string>Push the limits of maximum-speed transfers. Aspera Connect helps you securely move files and folders of any size.</string>
             <key>developer</key>
             <string>IBM Corp</string>
             <key>display_name</key>
             <string>Aspera Connect</string>
             <key>name</key>
             <string>%NAME%</string>
             <key>unattended_install</key>
             <true/>
             <key>unattended_uninstall</key>
             <true/>
         </dict>
     </dict>
     <key>MinimumVersion</key>
     <string>0.6.1</string>
     <key>ParentRecipe</key>
     <string>com.github.dataJAR-recipes.download.Aspera Connect</string>
     <key>Process</key>
     <array>
         <dict>
             <key>Processor</key>
             <string>FlatPkgUnpacker</string>
             <key>Arguments</key>
             <dict>
                 <key>flat_pkg_path</key>
                 <string>%input_path%</string>
                 <key>destination_path</key>
                 <string>%RECIPE_CACHE_DIR%/installer_unpack</string>
                 <key>purge_destination</key>
                 <true/>
             </dict>
         </dict>
         <dict>
             <key>Processor</key>
             <string>PkgPayloadUnpacker</string>
             <key>Arguments</key>
             <dict>
                 <key>destination_path</key>
                 <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                 <key>pkg_payload_path</key>
                 <string>%RECIPE_CACHE_DIR%/installer_unpack/IBMAsperaConnect.pkg/Payload</string>
                 <key>purge_destination</key>
                 <false/>
             </dict>
         </dict>
         <dict>
             <key>Processor</key>
             <string>PkgPayloadUnpacker</string>
             <key>Arguments</key>
             <dict>
                 <key>destination_path</key>
                 <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                 <key>pkg_payload_path</key>
                 <string>%RECIPE_CACHE_DIR%/installer_unpack/IBMAsperaCrypt.pkg/Payload</string>
                 <key>purge_destination</key>
                 <false/>
             </dict>
         </dict>
         <dict>
             <key>Processor</key>
             <string>PkgPayloadUnpacker</string>
             <key>Arguments</key>
             <dict>
                 <key>destination_path</key>
                 <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                 <key>pkg_payload_path</key>
                 <string>%RECIPE_CACHE_DIR%/installer_unpack/IBMAsperaLauncher.pkg/Payload</string>
                 <key>purge_destination</key>
                 <false/>
             </dict>
         </dict>
         <dict>
             <key>Processor</key>
             <string>MunkiInstallsItemsCreator</string>
             <key>Arguments</key>
             <dict>
                 <key>faux_root</key>
                 <string>%destination_path%</string>
                 <key>installs_item_paths</key>
                 <array>
                     <string>/Applications/Aspera Connect.app</string>
                     <string>/Applications/Aspera Crypt.app</string>
                     <string>/Applications/IBM Aspera Launcher.app</string>
                 </array>
             </dict>
         </dict>
         <dict>
             <key>Processor</key>
             <string>MunkiPkginfoMerger</string>
         </dict>
         <dict>
             <key>Processor</key>
             <string>Versioner</string>
             <key>Arguments</key>
             <dict>
                 <key>input_plist_path</key>
                 <string>%destination_path%Applications/Aspera Connect.app/Contents/Info.plist</string>
             </dict>
         </dict>
         <dict>
             <key>Processor</key>
             <string>MunkiPkginfoMerger</string>
             <key>Arguments</key>
             <dict>
                 <key>additional_pkginfo</key>
                 <dict>
                     <key>version</key>
                     <string>%version%</string>
                 </dict>
             </dict>
         </dict>
         <dict>  
             <key>Processor</key>
             <string>MunkiImporter</string>
             <key>Arguments</key>
             <dict>
                 <key>pkg_path</key>
                 <string>%pkg_path%</string>
                 <key>repo_subdirectory</key>
                 <string>%MUNKI_REPO_SUBDIR%</string>
             </dict>
         </dict>
         <dict>
             <key>Processor</key>
             <string>PathDeleter</string>
             <key>Arguments</key>
             <dict>
                 <key>path_list</key>
                 <array>
                     <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                     <string>%RECIPE_CACHE_DIR%/installer_pkg/</string>
                     <string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
                 </array>
             </dict>
         </dict>
     </array>
 </dict>
 </plist> 