<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of R1 V3, builds a package and imports it to Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.R1 V3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>R1V3</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>R1 V3</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Applications</string>
            <key>description</key>
            <string>The R1 Remote control software presents a d&amp;b system graphically, channel by channel, loudspeaker by loudspeaker, group by group, with faders and buttons arranged just as required. Dials and displays control equalization, delay, levels, switchable filter functions, Mute and power. Even an offline mode is available for advance preparation.</string>
            <key>developer</key>
            <string>d&amp;b audiotechnik GmbH &amp; Co</string>
            <key>display_name</key>
            <string>R1 V3</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.3</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.R1 V3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>