<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Finale 27 and creates a package</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.Finale27</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Finale</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Finale27</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Finale*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>pkg_payload_path</key>
                <string>%found_filename%/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Applications/Finale.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Scripts</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/FinaleSetup.dmg</string>
                <key>overwrite</key>
                <true/>
                <key>source_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1.0"&gt;
&lt;array&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;1&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;-1&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;1&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;false/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;0&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_2_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;0&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;0&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_1&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;visible&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;true/&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;enabled&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_2&lt;/string&gt;
    &lt;/dict&gt;
    &lt;dict&gt;
        &lt;key&gt;attributeSetting&lt;/key&gt;
        &lt;integer&gt;0&lt;/integer&gt;
        &lt;key&gt;choiceAttribute&lt;/key&gt;
        &lt;string&gt;selected&lt;/string&gt;
        &lt;key&gt;choiceIdentifier&lt;/key&gt;
        &lt;string&gt;installer_choice_3_2&lt;/string&gt;
    &lt;/dict&gt;
&lt;/array&gt;
&lt;/plist&gt;</string>
                <key>file_mode</key>
                <string>0744</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/silentInstallerChoices.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>#!/bin/sh
# Installs Finale. Assumes installer is already available in the path specified by $install_dir.

# Determine working directory
install_dir=$(dirname $0)

/usr/bin/hdiutil attach "${install_dir}/FinaleSetup.dmg" -nobrowse
/usr/sbin/installer -pkg "/Volumes/Finale/Install Finale.pkg" -tgt / -applyChoiceChangesXML "${install_dir}/silentInstallerChoices.plist"
/usr/sbin/installer -pkg "/Volumes/Finale/External/Garritan_ARIA_Player.pkg" -tgt /
/usr/sbin/installer -pkg "/Volumes/Finale/External/Garritan_Instruments_for_Finale.pkg" -tgt /
/bin/sleep 10
/usr/bin/hdiutil detach "/Volumes/Finale"</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>id</key>
                    <string>com.makemusic.finale.pkg</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgtype</key>
                    <string>flat</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
