<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>manifest URL obtained from this thread on Jamf Nation: https://community.jamf.com/t5/jamf-pro/visual-studio-for-mac-deployment/m-p/292547/highlight/true#M260110</string>
    <key>Description</key>
    <string>Downloads the latest version of Visual Studio.

For the ARCH_TYPE variable use "x64" for Intel or "arm64" for Apple Silicon</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.VisualStudio</string>
    <key>Input</key>
    <dict>
        <key>ARCH_TYPE</key>
        <string>x64</string>
        <key>NAME</key>
        <string>VisualStudio</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(https://download\.visualstudio\.microsoft\.com/download/pr/[A-Za-z0-9]+(-[A-Za-z0-9]+)+/[A-Za-z0-9]+/visualstudioformac-([0-9]+(\.[0-9]+)+)-%ARCH_TYPE%\.dmg)</string>
                <key>result_output_var_name</key>
                <string>visualstudioformac_URL</string>
                <key>url</key>
                <string>https://aka.ms/vsmac/manifest/17-stable</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%visualstudioformac_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Visual Studio.app</string>
                <key>requirement</key>
                <string>identifier "com.microsoft.visual-studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
