<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Sennheiser AMBEO Orbit.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Sennheiser AMBEO Orbit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AMBEO Orbit</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>PKG's certificate has expired, and despite reaching out to the vendor has not been renewed - https://github.com/autopkg/dataJAR-recipes/issues/177</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://en-us.sennheiser.com/ambeo-orbit</string>
                <key>re_pattern</key>
                <string>https://assets\.sennheiser\.com/global-downloads/file/\d.*/Sennheiser_AMBEO_Orbit_\S.*_MAC\.zip</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/extract</string>
                <key>purge_destination</key>
                <true/>
                <key>archive_format</key>
                <string>zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/extract/Install Sennheiser AMBEO Orbit*.pkg</string>
            </dict>
        </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%found_filename%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Sennheiser electronic (XKNNU9WTL7)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
    </array>
</dict>
</plist>
