<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Creates a package for ARRI Reference Tool with custom receipt ID and version.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.ARRI Reference Tool</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ARRIReferenceTool</string>
        <key>PKG_ID</key>
        <string>com.pkg.arri.ARRIReferenceTool</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7.6</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.ARRI Reference Tool</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>find</key>
                <string>-</string>
                <key>input_string</key>
                <string>%version_hyphenated%</string>
                <key>replace</key>
                <string>.</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
            <key>Processor</key>
            <string>FindAndReplace</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>root/Applications</key>
                    <string>0777</string>
                    <key>scripts</key>
                    <string>0755</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/root/Applications/ARRI Reference Tool.app</string>
                <key>source_path</key>
                <string>%found_filename%/ARRI Reference Tool.app</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/payload/root</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
