<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Steel Series GG.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Steel Series GG</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SteelSeriesGG</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://steelseries.com/gg/downloads/gg/latest/darwin</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: SteelSeries (6WGL6CHFH2)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
