<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of DotNet 9 SDK

For the ARCH_TYPE variable use "x64" for Intel or "arm64" for Apple Silicon</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.DotNet 9 SDK</string>
    <key>Input</key>
    <dict>
        <key>ARCH_TYPE</key>
        <string>x64</string>
        <key>NAME</key>
        <string>DotNet9SDK</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(/en-us/download/dotnet/thank-you/sdk-9.([0-9]+(\.[0-9]+)+)-macos-%ARCH_TYPE%-installer)\"</string>
                <key>result_output_var_name</key>
                <string>SEARCH_URL</string>
                <key>url</key>
                <string>https://dotnet.microsoft.com/en-us/download/dotnet/9.0</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(https://builds\.dotnet\.microsoft\.com/dotnet/Sdk/9\.([0-9]+(\.[0-9]+)+)/dotnet-sdk-9\.([0-9]+(\.[0-9]+)+)-osx-%ARCH_TYPE%\.pkg)\"</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
                <key>url</key>
                <string>https://dotnet.microsoft.com%SEARCH_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
