<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of PaperCut Print Deploy Client and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.PaperCut Print Deploy Client</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>PaperCutPrintDeployClient</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Print queues made easy

Get the right print driver and right print queue to the right person in the right location, every single time.</string>
            <key>developer</key>
            <string>PaperCut Software International Pty Ltd</string>
            <key>display_name</key>
            <string>PaperCut Print Deploy Client</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash
# Script taken from /Applications/PaperCut Print Deploy Client/direct-print-monitor/Uninstall.command

if [ -f '/Applications/PaperCut Print Deploy Client/direct-print-monitor/Uninstall.command' ]; then
    echo 'Uninstalling Direct print monitor...'
    #
    # Stop and disable direct print monitor services
    #
    '/Applications/PaperCut Print Deploy Client/direct-print-monitor/Uninstall.command'
    sleep 5
fi
echo 'Uninstalling...'
#
# Stop and disable services
#
'/Applications/PaperCut Print Deploy Client/pc-print-deploy-client' uninstall

sleep 5

#
# Remove startup entry
#
rm -rf /Library/LaunchAgents/com.papercut.printdeploy.client.plist

#
# Execute the uninitialise script
#
'/Applications/PaperCut Print Deploy Client/uninitialise'

#
# Remove files install... Note: we only remove files that we've put in
# our top directory.
#
rm -rf '/Applications/PaperCut Print Deploy Client'

#
# Remove the install receipt reference which the Mac uses to know what packages are installed.
# If these are not removed then the mac can block us from installing previous versions
#
rm -f /private/var/db/receipts/com.papercut.printdeploy.client.*  2>/dev/null

echo "Uninstall complete."</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.PaperCut Print Deploy Client</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>find</key>
                <string> </string>
                <key>input_string</key>
                <string>file://localhost/%RECIPE_CACHE_DIR%/unpacked/Distribution</string>
                <key>replace</key>
                <string>%20</string>
            </dict>
            <key>Processor</key>
            <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>system\.version\.ProductVersion, &apos;([0-9]*\.[0-9]+)&apos;</string>
                <key>result_output_var_name</key>
                <string>min_os_ver</string>
                <key>url</key>
                <string>%output_string%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
             <key>Arguments</key>
             <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%min_os_ver%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
