<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Microsoft Teams.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Microsoft Teams</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftTeams</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/DOWNLOAD_XML</string>
                <key>filename</key>
                <string>0409TEAMS21-chk.plist</string>
                <key>url</key>
                <string>https://officecdnmac.microsoft.com/pr/C1297A47-86C4-4C1F-97FA-950631F94777/MacAutoupdate/0409TEAMS21-chk.xml</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/DOWNLOAD_XML/0409TEAMS21-chk.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>Update Version</key>
                    <string>DOWNLOAD_VERSION</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/downloads</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://statics.teams.cdn.office.net/production-osx/%DOWNLOAD_VERSION%/MicrosoftTeams.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
    <key>comment</key>
    <string>MAU Auto Update Feed XML found in this file: /private/var/folders/mz/rlwv61sj09b4rsswdgntc2nh0000gp/T/TelemetryUploadFilecom.microsoft.autoupdate.fba.txt</string>
</dict>
</plist>
