<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Citrix ShareFile and modifies a preinstall so that is no longer triggers PPPC warnings for Installer to manager System Events.

NOTES:
- PREINSTALL_SCRIPT_PATH must be set to reflect the location of the "preinstall" script--it can point back to the preinstall in the directory of the original recipe, but due to overrides it must be a piece of override-able INPUT
- This recipe depends on hjuutilainen's ChecksumVerifier.  Add hjuutilainen's repo via:
autopkg repo-add hjuutilainen-recipes

- This recipe depends on jessepeterson's ModeChanger.  Add jessepeterson's repo via:
autopkg repo-add jessepeterson-recipes</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.ShareFile</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShareFile</string>
        <key>PREINSTALL_SCRIPT_PATH</key>
        <string>%RECIPE_DIR%/Reference Scripts ShareFile/Fixed Script/preinstall</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.ShareFile</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/Install ShareFile.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/</string>
                <key>flat_pkg_path</key>
                <string>%pkg_path%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/ShareFile.pkg/Payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>algorithm</key>
                <string>MD5</string>
                <key>checksum</key>
                <string>f7fa45b370314a1e70c21a99b6adfcc2</string>
                <key>pathname</key>
                <string>%RECIPE_CACHE_DIR%/unpack/ShareFile.pkg/Scripts/preinstall</string>
            </dict>
            <key>Comment</key>
            <string>Verify MD5 matches ShareFile.pkg preinstall script from ShareFile 2023.8.8r3</string>
            <key>Processor</key>
            <string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack/ShareFile.pkg/Scripts/preinstall</string>
                </array>
            </dict>
            <key>Comment</key>
            <string>An edit of ShareFile's preinstall, commenting out the lines that trigger Installer.app PPPC warnings</string>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/ShareFile.pkg/Scripts/preinstall</string>
                <key>source_path</key>
                <string>%PREINSTALL_SCRIPT_PATH%</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%RECIPE_CACHE_DIR%/unpack/ShareFile.pkg/Scripts/preinstall</string>
                <key>mode</key>
                <string>755</string>
            </dict>
            <key>Comment</key>
            <string>755 POSIX permissions since the preinstall needs to be executable</string>
            <key>Processor</key>
            <string>com.github.jessepeterson.munki.UniversalTypeClient6/ModeChanger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/payload/root</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/root</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/ShareFile.pkg/Payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/ShareFile.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/repack</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/repack/ShareFile-%version%.pkg</string>
                <key>source_flatpkg_dir</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
        </dict>
    </array>
</dict>
</plist>
