<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for ShareFile.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.ShareFile</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShareFile</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.citrix.com/downloads/citrix-content-collaboration/product-software/sharefile-for-mac.html</string>
                <key>re_pattern</key>
                <string>filepathOrUrl: \"(https://dl.sharefile.com/.*mac) \"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install ShareFile.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Citrix Systems, Inc. (S272Y5R93J)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>