<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of SoundQ.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.SoundQ</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SoundQ</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://prosoundeffects.blob.core.windows.net/software-updates/SoundQ/SoundQ_v([0-9]+(.[0-9]+)+).pkg\?version=[0-9]+</string>
                <key>result_output_var_name</key>
                <string>VERSION_1</string>
                <key>url</key>
                <string>https://www.prosoundeffects.com/soundq</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>.pkg\?version=([0-9]+)</string>
                <key>result_output_var_name</key>
                <string>VERSION_2</string>
                <key>url</key>
                <string>https://www.prosoundeffects.com/soundq</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://prosoundeffects.blob.core.windows.net/software-updates/SoundQ/SoundQ_v%VERSION_1%.pkg?version=%VERSION_2%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Mediaspora LLC (86UZV94CQ9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
