<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of ShowReady</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.ShowReady</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ShowReady</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>https://downloads.rocsapis.com/ShowReady/ShowReady-Mac-v([0-9]+(\.[0-9]+)+).dmg</string>
                    <key>result_output_var_name</key>
                    <string>VERSION</string>
                    <key>url</key>
                    <string>https://rightoncueservices.com/download-showready/</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://downloads.rocsapis.com/ShowReady/ShowReady-Mac-v%VERSION%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Show|Ready.app</string>
                    <key>requirement</key>
                    <string>identifier "Show|Ready" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = YW27Y3HK3T</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
