<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of GoTo.

To download the Apple Silicon version use "-arm64" in the ARCH_TYPE variable.
To download the Intel Version leave the ARCH_TYPE variable empty.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.GoTo</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoTo</string>
        <key>ARCH_TYPE</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.tgz</string>
                <key>url</key>
                <string>https://goto-desktop.getgo.com/GoTo%ARCH_TYPE%-mac.tar.gz</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/GoTo.app</string>
                <key>requirement</key>
                <string>identifier "com.logmein.goto" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GFNFVT632V</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
