<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of jHelper GUI and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.pkg.jHelper GUI</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>org.jordanpatrick.jHelper-GUI</string>
		<key>NAME</key>
		<string>jHelperGUI</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.jHelper GUI</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>jHelper GUI is no longer available for download. Please do not use this recipe.</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
