<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Final Draft 11 and imports it into Munki.

Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator.</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.munki.FinalDraft11</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>FinalDraft11</string>
            <key>DERIVE_MIN_OS</key>
            <string>YES</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Final Draft is a screenwriting application for writing and formatting screenplays.</string>
                <key>developer</key>
                <string>Cast and Crew</string>
                <key>display_name</key>
                <string>Final Draft 11</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>2.7</string>
        <key>ParentRecipe</key>
        <string>com.github.dataJAR-recipes.download.FinalDraft11</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unzip</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
                    <key>flat_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/unzip/Final Draft 11 Installer.pkg</string>
                    <key>purge_destination</key>
                    <string>true</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/installer_payload/Applications/</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/installer_unpack/finalDraft11.pkg/Payload</string>
                    <key>purge_destination</key>
                    <string>true</string>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/installer_payload/Applications/Final Draft 11.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/unzip/Final Draft 11 Installer.pkg</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>PkgCopier</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>derive_minimum_os_version</key>
                    <string>%DERIVE_MIN_OS%</string>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Applications/Final Draft 11.app</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.dataJAR-recipes.Shared Processors/QuarantineRemover</string>
                <key>Arguments</key>
                <dict>
                    <key>quarantined_files_path</key>
                    <string>%pkg_path%</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                        <string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
                        <string>%RECIPE_CACHE_DIR%/unzip/</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>
</plist>
