<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of the Final Draft 11 and extracts the pkg.</string>
		<key>Identifier</key>
		<string>com.github.dataJAR-recipes.pkg.FinalDraft11</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>FinalDraft11</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>ParentRecipe</key>
		<string>com.github.dataJAR-recipes.download.FinalDraft11</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unzip</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
					<key>flat_pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/unzip/Final Draft 11 Installer.pkg</string>
					<key>purge_destination</key>
					<string>true</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/installer_payload/Applications/</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/installer_unpack/finalDraft11.pkg/Payload</string>
					<key>purge_destination</key>
					<string>true</string>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/installer_payload/Applications/Final Draft 11.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%RECIPE_CACHE_DIR%/unzip/Final Draft 11 Installer.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>PkgCopier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/installer_payload/</string>
						<string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
						<string>%RECIPE_CACHE_DIR%/unzip/</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>