<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Dolby Atmos Composer Essential.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Dolby Atmos Composer Essential</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DolbyAtmosComposerEssential</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://fiedler-audio.com/?wpdmdl=9525</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install Dolby Atmos Composer Essential.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Thomas Fiedler (7H8CGTH5F3)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
