<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of framer-modules imports into Munki</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.framer-modules</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Applictions/%NAME%</string>
        <key>NAME</key>
        <string>framer-modules</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>production</string>
            </array>
                <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>kysely</string>
            <key>description</key>
            <string>Tired of downloading and copying modules to the prototype on your own? We all are. That's why installing modules is now so easy even your grandma can do it.</string>
            <key>display_name</key>
            <string>framer-modules</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.framer-modules</string>
<key>Process</key>
<array>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>pkg_path</key>
            <string>%pathname%</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
    </dict>
</array>
</dict>
</plist>
