<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of DisplayLink Manager and imports into Munki</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.DisplayLink Manager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DisplayLink Manager</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>DisplayLink Manager is a new way to enable your DisplayLink dock, adapter or monitor on macOS platforms. It's an application that combines our latest driver with features that streamline the setup of mutliple displays up to 4K.</string>
            <key>developer</key>
            <string>DisplayLink</string>
            <key>display_name</key>
            <string>DisplayLink Manager</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash

# uninstall mode: "full" (uninstall app and sandbox containers) or "partial", default "partial" for app pkg
readonly uninstall_mode=${1:-full}

echo "DisplayLink uninstall script"

are_dl_processes_running()
{
    pgrep DisplayLink &amp;&gt; /dev/null
}

echo -e "\n&gt; DisplayLink uninstaller running in \"${uninstall_mode}\" mode"

get_users()
{
  dscl . list /Users | grep -v -e '^_.*' -e daemon -e nobody
}

transfer_legacy_autostart_settings()
{
  local user=$1
  local dlua_xml
  dlua_xml="/Users/$user/Library/Group Containers/73YQY62QM3.com.displaylink.DisplayLinkShared/Library/Application Support/Logs/.dlua.xml"

  local autostart
  autostart=$(grep '&lt;value name="AutoStart"&gt;' "$dlua_xml" 2&gt; /dev/null | grep -o 'yes\|no') #read AutoStart value from dlua.xml
  [ -z "$autostart" ] &amp;&amp; return
  sed -i '' 's/\&lt;value name="AutoStart"\&gt;[a-z]\{2,3\}\&lt;\/value\&gt;//g' "$dlua_xml" 2&gt; /dev/null #delete AutoStart key from dlua.xml

  autostart=$(echo "$autostart" | sed 's/yes/1/g;s/no/0/g') #replace "yes" with 1 and "no" with 0 for coherence in defaults
  su -l "$user" -c "defaults write /Users/$user/Library/Containers/com.displaylink.DisplayLinkUserAgent/Data/Library/Preferences/com.displaylink.DisplayLinkUserAgent.plist AppAutostart $autostart" #transfer legacy value
}

remove_displaylink_useragents_and_daemons_for_all_users()
{
  echo -e "\n&gt; Removing DisplayLink user agents"
  launchctl list | grep DisplayLink &amp;&gt; /dev/null
  local had_deamons_installed=$?

  for user in $(get_users); do
    su -l "$user" -c 'launchctl remove com.displaylink.useragent' # legacy useragent name
    su -l "$user" -c 'launchctl remove com.displaylink.DisplayLink Manager' # legacy useragent name
    su -l "$user" -c 'launchctl remove com.displaylink.DisplayLinkManager' # when running as appstore app this is user daemon
    su -l "$user" -c 'launchctl remove com.displaylink.DisplayLinkLoginHelper' # when running as appstore app this is login helper
    [ "${uninstall_mode}" == "full" ] &amp;&amp;  su -l "$user" -c 'launchctl remove com.displaylink.loginscreen' # pre-login agent for appstore app

    [ "${uninstall_mode}" == "partial" ] &amp;&amp;  transfer_legacy_autostart_settings "$user"
    [ "${uninstall_mode}" == "full" ] &amp;&amp;  su -l "$user" -c 'defaults delete com.displaylink.DisplayLinkUserAgent' # delete persistent settings
  done

  echo -e "\n&gt; Removing DisplayLink daemon"
  launchctl remove com.displaylink.displaylinkmanager # legacy daemon name
  launchctl remove com.displaylink.DisplayLinkManager

  if [[ $had_deamons_installed -eq 0 ]]; then
    wait_for_dl_processes_finished 10
  fi
}

remove_sandbox_containers()
{
  echo -e "\n&gt; Remove sandbox containers"
  for i in ~root /Users/*
  do
    echo "$i"
    sudo rm -fr "$i/Library/Containers/com.displaylink.DisplayLink Manager"
    sudo rm -fr "$i/Library/Containers/com.displaylink.DisplayLinkManager"
    sudo rm -fr "$i/Library/Containers/com.displaylink.DisplayLinkLoginHelper"
    sudo rm -fr "$i/Library/Containers/com.displaylink.DisplayLinkUserAgent"

    rm -fr "$i/Library/Group Containers/73YQY62QM3.com.displaylink.DisplayLinkShared"
    rm -fr "$i/Library/Group Containers/com.displaylink.DisplayLinkShared"
  done
}

remove_application_scripts()
{
  echo -e "\n&gt; Remove application scripts"
  for i in ~root /Users/*
  do
    sudo rm -fr "$i/Library/Application Scripts/com.displaylink.DisplayLinkLoginHelper"
    sudo rm -fr "$i/Library/Application Scripts/com.displaylink.DisplayLinkManager"
    sudo rm -fr "$i/Library/Application Scripts/com.displaylink.DisplayLinkUserAgent"
    sudo rm -fr "$i/Library/Application Scripts/com.displaylink.DisplayLink_Manager"
  done
}

terminate_any_remaining_dl_processes()
{
  if are_dl_processes_running; then
    echo "Terminate remaining DisplayLink processes"
    sudo killall -SIGTERM 'DisplayLink Manager'
    sudo killall -SIGTERM DisplayLinkUserAgent
    sudo killall -SIGTERM DisplayLinkManager
  fi

  wait_for_dl_processes_finished 5
  if are_dl_processes_running; then
    echo "Kill remaining DisplayLink processes"
    sudo killall -SIGKILL 'DisplayLink Manager'
    sudo killall -SIGKILL DisplayLinkUserAgent
    sudo killall -SIGKILL DisplayLinkManager
  fi
}

wait_for_dl_processes_finished()
{
  local timeout=$1

  while [[ $(( timeout-- )) -gt 0 ]]
  do
    if ! are_dl_processes_running; then
      echo "All DisplayLink processes are finished"
      break
    fi

    echo "Wait for dl prcesses to finish"
    sleep 1
  done
}

rebuildKextCache()
{
  echo -e "\n&gt; Refresh kext cache"
  touch /System/Library/Extensions
  touch /Library/Extensions
  rm -f /System/Library/Extensions.kextcache
}

removeKEXTs()
{
  local kext_uninstall_flag=/tmp/dl_app_installer_requires_restart

  local kextfiles=(
    "/Library/Extensions/DisplayLinkDriver.kext"
    "/System/Library/Extensions/DisplayLinkDriver.kext"
    "/Library/Extensions/DisplayLinkEthernetDriver.kext"
    "/System/Library/Extensions/DisplayLinkDriver0.9.kext"
    "/System/Library/Extensions/DisplayLinkEthernetDriver.kext"
    "/System/Library/Extensions/DisplayLinkNcmDriver.kext"
    "/System/Library/Extensions/DisplayLinkNullDriver.kext"
  )

  for f in "${kextfiles[@]}"
  do
    if [[ -e $f || -h $f ]]
    then
      echo "Removing $f..."
      if ! rm -R "$f"
      then
        echo "ERROR: Unable to remove $f. Please remove manually."
      fi
      touch "$kext_uninstall_flag"
      echo "$f KEXT successfully removed."
    else
      echo "$f KEXT not found, skipping."
    fi
  done

  if [[ -e $kext_uninstall_flag ]]
  then
    rebuildKextCache
  fi
}

remove_displaylink_useragents_and_daemons_for_all_users
terminate_any_remaining_dl_processes

files=(
    "/Applications/DisplayLink"
    "/Library/Application Support/DisplayLink"
    "/Library/LaunchAgents/73YQY62QM3.com.displaylink.DisplayLinkAPServer.plist"
    "/Library/LaunchAgents/com.displaylink.useragent-prelogin.plist"
    "/Library/LaunchAgents/com.displaylink.useragent.plist"
    "/Library/LaunchDaemons/com.displaylink.displaylinkmanager.plist"
    "/Library/LaunchDaemons/com.displaylink.launchd.plist"
    "/Library/Preferences/com.displaylink.plist"
    "/Library/PrivilegedHelperTools/DisplayLink"
    "/Library/Receipts/DisplayLink Software Installer.pkg"
    "/Library/StartupItems/DisplayLinkAgent"
    "/System/Library/Extensions/DisplayLinkGA.plugin"
    "/System/Library/Extensions/DisplayLinkGA_10.6.plugin"
    "/etc/asl/com.displaylink.windowserver"
    "/var/db/receipts/com.displaylink*"
    "/var/log/displaylink"
)

if [[ ${uninstall_mode} == "full" ]]
then
  files+=("/Applications/DisplayLink Software Uninstaller.app"
        "/Applications/DisplayLink Manager.app"
        "/Library/LaunchAgents/com.displaylink.loginscreen.plist")
fi

for f in "${files[@]}"
do
  if [[ -e $f || -h $f ]]
  then
    echo "Removing $f..."
    if ! rm -R "$f"
    then
      echo "ERROR: Unable to remove $f. Please remove manually."
    fi
    echo "$f successfully removed."
  else
    echo "$f not found, skipping."
  fi
done

removeKEXTs

echo -e "\n&gt; Remove plists from user directories"
for i in ~root /Users/*
do
  rm -vf "$i/Library/Preferences/com.displaylink.displaylinkmanager.plist"
  rm -vf "$i/Library/Preferences/com.displaylink.airdisplaypriority.plist"
done

if [[ ${uninstall_mode} == "full" ]]; then
  remove_sandbox_containers
  remove_application_scripts
fi

echo -e "\n&gt; DisplayLink uninstall script done."

exit</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.smithjw.pkg.DisplayLink_Manager</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/DisplayLink_Manager-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>com.github.dataJAR-recipes.Shared Processors/ComponentPkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked</string>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/expanded_pkg/Scripts/%SOFTWARE_TITLE%-%version%.pkg</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/DisplayLinkManagerApp.pkg/Payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/DisplayLink Manager.app</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/DisplayLink Manager.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>LSMinimumSystemVersion</key>
                    <string>min_os_version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%min_os_version%</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/DisplayLink_Manager-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
