<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of the Wondershare Filmora X.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Wondershare Filmora X</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WondershareFilmora X</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\"downloadUrl\" : \"https://download\.wondershare\.com/(filmora-mac_.*.dmg)\",</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://cbs.wondershare.com/go.php?pid=718</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.wondershare.com/cbs_down/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Wondershare Filmora X.app</string>
                <key>requirement</key>
                <string>identifier "com.wondershare.filmoramac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = YZC2T44ZDX</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>