<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Resolume Arena.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Resolume Arena</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Resolume Arena</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://resolume.com/download/?file=latest_arena</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_NAME</string>
                <key>re_pattern</key>
                <string>href=\"https://resolume\.com/download/file\?file=(Resolume_Arena_([0-9]+(_[0-9]+)+)_rev_[A-Za-z0-9]+_Installer\.dmg)\"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://dd5sgwxv3xok.cloudfront.net/%DOWNLOAD_NAME%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
         <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
              <key>input_path</key>
               <string>%pathname%/Resolume Arena Installer.pkg</string>
               <key>expected_authority_names</key>
               <array>
                   <string>Developer ID Installer: Resolume (Z9Y8N6Q4L8)</string>
                   <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
               </array>
          </dict>
        </dict>
    </array>
</dict>
</plist>
