<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Cisco Webex Meetings.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.CiscoWebexMeetings</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_URL</key>
        <string>https://akamaicdn.webex.com/client/webexapp.dmg</string>
        <key>NAME</key>
        <string>Cisco Webex Meetings</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This package from Cisco deploys files into /tmp then uses a post-
                script to move them into the logged in user's home area. As a result, this
                isn't mass-deployable and isn't fully patchable. As a result, we have
                depreciated this recipe.</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
    </array>
</dict>
</plist>
