<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of AJA U-TAP Updater.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.AJA U-TAP Updater</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AJAU-TAPUpdater</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\/support\\\/files\\\/[A-Za-z0-9]+\\\/en\\/(AJA_U-TAP_Updater_macOS_v([0-9]+(\.[0-9]+)+)\.zip)</string>
                <key>url</key>
                <string>https://www.aja.com/products/u-tap-sdi#support</string>
                <key>result_output_var_name</key>
                <string>FILE_NAME</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\/support\\\/files\\\/([A-Za-z0-9]+)\\\/en\\/AJA_U-TAP_Updater_macOS_v</string>
                <key>url</key>
                <string>https://www.aja.com/products/u-tap-sdi#support</string>
                <key>result_output_var_name</key>
                <string>FOLDER_NAME</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.aja.com/assets/support/files/%FOLDER_NAME%/en/%FILE_NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unzip/AJA_U-TAP_Updater_*/AJA_U-TAP_Updater_*.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%/AJA U-TAP Updater.app</string>
                <key>requirement</key>
                <string>identifier "com.aja.utapconfig" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9VB857J7CD"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
