<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and builds a package that installs the latest version of ngrok, installing the binary to /usr/local/bin/ngrok</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.ngrok</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ngrok</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.ngrok</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>ngrokVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>binary_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/usr/local/bin/ngrok</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.ngrok.ngrok</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>