<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Navicat Essentials for MySQL and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.munki.Navicat Essentials for MySQL</string>
	  <key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>NavicatEssentialsforMySQL</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>developer</key>
			<string>PremiumSoft</string>
			<key>description</key>
			<string>Navicat for MySQL is the ideal solution for MySQL/MariaDB administration and development.</string>
			<key>display_name</key>
			<string>Navicat Essentials for MySQL</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Navicat Essentials for MySQL</string>
	    <key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
	    </array>
</dict>
</plist>