<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Sennheiser Wireless Systems Manager and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Sennheiser Wireless Systems Manager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WirelessSystemsManager</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Sennheiser's Wireless Systems Manager is a professional software solution for remotely monitoring and controlling wireless systems. Its intelligent features make the WSM the ideal choice for TV studios, live events, as well as musical productions. Wireless Systems Manager for Mac and Windows assists users in setting up and coordinating the frequencies of wireless microphones and personal monitors by having the most important parameters like charging levels handily displayed on a single screen.</string>
            <key>developer</key>
            <string>Sennheiser</string>
            <key>display_name</key>
            <string>Wireless Systems Manager</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Sennheiser Wireless Systems Manager</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
