<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Imports Adobe Illustrator 2023 into Munki, please review:
https://github.com/autopkg/dataJAR-test-recipes./blob/master/Adobe%20Admin%20Console%20Packages/README.md</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.munki.Adobe Illustrator 2023</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_CATEGORY</key>
            <string>Adobe CC</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Adobe</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>%aacp_application_description%</string>
            <key>MUNKI_DISPLAY_NAME</key>
            <string>%aacp_application_display_name%</string>
            <key>NAME</key>
            <string>%aacp_name%</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%MUNKI_DISPLAY_NAME%</string>
                <key>minimum_os_version</key>
                <string>%aacp_minimum_os%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>CFBundleIdentifier</key>
                                <string>%aacp_bundle_identifier%</string>
                                <key>CFBundleShortVersionString</key>
                                <string>%aacp_bundle_short_version_string%</string>
                                <key>CFBundleVersion</key>
                                <string>%aacp_bundle_version%</string>
                                <key>path</key>
                                <string>%aacp_application_full_path%</string>
                                <key>type</key>
                                <string>application</string>
                                <key>version_comparison_key</key>
                                <string>%aacp_version_comparison_key%</string>
                            </dict>
                        </array>
                        <key>uninstall_method</key>
                        <string>uninstall_script</string>
                        <key>uninstall_script</key>
                        <string>#!/bin/bash
#
# Copyright (c) 2024, Jamf Ltd.  All rights reserved.
#
# Uninstall via the Adobe uninstall tool
# https://helpx.adobe.com/uk/enterprise/using/uninstall-creative-cloud-products.html
#

# Path to the uninstaller
uninstallerPath="/Library/Application Support/Adobe/Adobe Desktop Common/HDBox/Setup"

# If the uninstaller exists
if [ -f "${uninstallerPath}" ]
then
    # Progress notification
    /bin/echo "Uninstalling %aacp_application_display_name%..."
    # Attempt the uninstall
    if "${uninstallerPath}" --baseVersion="%aacp_application_base_version%" --deleteUserPreferences="false" --platform="macOS" --sapCode="%aacp_application_sap_code%" --uninstall="1"
    then
        # Progress notification
        /bin/echo "Successfully uninstalled %aacp_application_display_name%..."
    # If the uninstall fails
    else
        # Error
        /bin/echo "ERROR: Uninstall of %aacp_application_display_name% failed, exiting..."
        # Exit
        exit 1
    fi
# If the uninstaller cannot be found
else
    # Error
    /bin/echo "ERROR: Cannot locate: ${uninstallerPath}, exiting..."
    # Exit
    exit 1
fi</string>
                        <key>version</key>
                        <string>%aacp_application_version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%aacp_package_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
