<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Imports Adobe Acrobat DC into Munki, please review:
https://github.com/autopkg/dataJAR-recipes/blob/master/Adobe%20Admin%20Console%20Packages/README.md</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.munki.Adobe Acrobat DC</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_CATEGORY</key>
            <string>Adobe CC</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Adobe</string>
            <key>NAME</key>
            <string>AdobeAcrobatDC</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
                <key>uninstall_method</key>
                <string>uninstall_script</string>
                <key>uninstall_script</key>
                <string>#!/bin/bash
    #
    # Uninstalls via the Adobe uninstall tool
    # https://helpx.adobe.com/uk/enterprise/using/uninstall-creative-cloud-products.html
    #

    # Path to the uninstaller
    uninstallerPath="/Library/Application Support/Adobe/Adobe Desktop Common/HDBox/Setup"

    # If the uninstaller exists
    if [ -f "${uninstallerPath}" ]
    then
        # Progress notification
        /bin/echo "Uninstalling %aacp_application_display_name%..."
        # Perform the uninstall
        "${uninstallerPath}" --baseVersion=%aacp_application_base_version% --deleteUserPreferences=false --platform=macOS --sapCode=%aacp_application_sap_code% --uninstall=1
        # Progress notification
        /bin/echo "Uninstalling %aacp_application_display_name%..."
    # If the uninstaller cannot be found
    else
        # Error
        /bin/echo "ERROR: Cannot locate: ${uninstallerPath}, exiting..."
        # Exit
        exit 1
    fi</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AdobeAdminConsolePackagesPkgInfoCreator</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%aacp_application_architecture_type%-%version%.dmg</string>
                    <key>dmg_root</key>
                    <string>%aacp_package_path%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>installer_type</key>
                        <string/>
                        <key>uninstall_method</key>
                        <string>uninstall_script</string>
                        <key>uninstall_script</key>
                        <string>#!/bin/bash
#
# Copyright (c) 2024, Jamf Ltd.  All rights reserved.
#
# Uninstall via com.adobe.Acrobat.RemoverTool
# https://www.adobe.com/devnet-docs/acrobatetk/tools/AdminGuide_Mac/macintosh_deployment.html#uninstalling
#

# Path to the uninstaller
uninstallerPath="/Applications/Adobe Acrobat DC/Adobe Acrobat.app/Contents/Helpers/Acrobat Uninstaller.app/Contents/Library/LaunchServices/com.adobe.Acrobat.RemoverTool"

# If the uninstaller exists
if [ -f "${uninstallerPath}" ]
then
    # Progress notification
    /bin/echo "Uninstalling %aacp_application_display_name%..."
    # Attempt the uninstall
    if "${uninstallerPath}"
    then
        # Progress notification
        /bin/echo "Uninstalled %aacp_application_display_name%..."
    # If the uninstall fails
    else
        # Error
        /bin/echo "ERROR: Uninstall of %aacp_application_display_name% failed, exiting..."
        # Exit
        exit 1
    fi
# If the uninstaller cannot be found
else
    # Error
    /bin/echo "ERROR: Cannot locate: ${uninstallerPath}, exiting..."
    # Exit
    exit 1
fi</string>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%aacp_application_architecture_type%-%version%.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>