<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MongoDB Compass.

To download the Intel version use "x64" in DOWNLOAD_TYPE
To download the Apple Silicon version use "arm64" in DOWNLOAD_TYPE</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.MongoDB Compass</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MongoDB Compass</string>
        <key>DOWNLOAD_TYPE</key>
        <string>x64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>mongodb-compass-([A-Za-z0-9]+(\.[A-Za-z0-9]+)+)-darwin</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_VERSION</string>
                <key>url</key>
                <string>https://www.mongodb.com/try/download/compass</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://downloads.mongodb.com/compass/mongodb-compass-%DOWNLOAD_VERSION%-darwin-%DOWNLOAD_TYPE%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/MongoDB Compass.app</string>
                <key>requirement</key>
                <string>identifier "com.mongodb.compass" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4XWMY46275"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
