<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for the latest version of Cubase LE AI Elements 9.5</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.Cubase LE AI Elements 9.5</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cubase LE AI Elements 9.5</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe has been deprecated. The softyware title is now unsuppoted by the vendor please see: https://o.steinberg.net/index.php?id=14790&amp;L=1 for further info. All download links currently direct to a 404 error page.</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://download.steinberg.net/downloads_software/Cubase_9.5/9\.[0-9]\.[0-9][0-9]/Cubase_LE_AI_Elements_9\.[0-9]\.[0-9][0-9]_Update_mac.dmg</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://o.steinberg.net/en/support/downloads/cubase_9.5.html</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Steinberg Media Technologies GmbH (5PMY476BJ6)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/Cubase LE AI Elements 9.5 Update.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
