<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest trial version of Kiwi for G Suite.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Kiwi for G Suite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KiwiforGSuite</string>
        <key>DOWNLOAD_URL</key>
        <string>https://kiwiforgsuite.s3.amazonaws.com/mac/release/Kiwi+for+G+Suite.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
        		<key>expected_authority_names</key>
        		<array>
            		<string>Developer ID Installer: Zive, Inc. (ND86S98S6P)</string>
            		<string>Developer ID Certification Authority</string>
            		<string>Apple Root CA</string>
        		</array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
