<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Kiwi for G Suite and creates a flat PKG.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.pkg.Kiwi for G Suite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KiwiforGSuite</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Kiwi for G Suite</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/installer_unpack</string>
                     <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                     <key>purge_destination</key>
                    <true />
                </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
         </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/installer_payload</string>
                 <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/installer_unpack/Payload</string>
                 <key>purge_destination</key>
                <true />
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/installer_payload/Applications/Kiwi for G Suite.app/Contents/Info.plist</string>
                 <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
             </dict>
             <key>Processor</key>
            <string>Versioner</string>
         </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                     <string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
                 </array>
             </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
