<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Aeon Timeline.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Aeon Timeline</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AeonTimeline</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>"macVersion":"([0-9]+(.[0-9]+)+)"</string>
                <key>result_output_var_name</key>
                <string>VERSION</string>
                <key>url</key>
                <string>https://passport.timeline.app/update/latestVersionNumber</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://aeon-timeline-3-release-notes.s3.amazonaws.com/%VERSION%/mac/AeonTimeline%VERSION%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Aeon Timeline.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "app.timeline.aeon" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5KV8KB6AQY")</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
