<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports into Munki the latest version of the 1Password Command Line Interface tool.

Based on https://github.com/autopkg/apettinen-recipes/blob/master/1Password_CLI/1Password_CLI.munki.recipe

1Password CLI will install to /usr/local/bin and preservers the op.sig signature for later verification via gpg or keybase.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.1Password CLI</string>
    <key>Input</key>
    <dict>
        <key>DISPLAY_NAME</key>
        <string>1Password Command Line Interface</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Agilebits</string>
        <key>MUNKI_NAME</key>
        <string>1PasswordCLI</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>REQUIRES</key>
        <string>1Password</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Bring the power of 1Password to the command line. Eliminate plaintext secrets in code, automate administrative tasks, and sign into any CLI with your fingerprint.</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>requires</key>
            <array>
                <string>%REQUIRES%</string>
            </array>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.1Password_CLI</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/usr/local/bin</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/op.pkg/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>binary_path</key>
                <string>%RECIPE_CACHE_DIR%/usr/local/bin/op</string>
            </dict>
            <key>Processor</key>
            <string>OnePasswordCLIVersioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installcheck_script</key>
                    <string>#!/bin/zsh

# Copyright 2025, Jamf Software, LLC.

#
# DESCRIPTION
#     Returns the version from the 1Password CLI binary and compares it with
#     the version to be installed via Munki.

# Function to compare version strings using sort -V
compare_versions() {
    local version1="$1"
    local version2="$2"

    # Use sort -V to compare versions
    local sorted_first=$(printf '%s\n%s\n' "$version1" "$version2" | sort -V | head -n1)

    if [[ "$sorted_first" == "$version1" ]] &amp;&amp; [[ "$version1" != "$version2" ]]; then
        # version1 is strictly less than version2
        return 0
    else
        # version1 is greater than or equal to version2
        return 1
    fi
}

binary_path="/usr/local/bin/op"
munki_version="%version%"

# If binary exists
if [[ -f "$binary_path" ]]; then
    # Get binary version
    if binary_version=$("$binary_path" --version 2&gt;/dev/null | tr -d ' '); then
        echo "Current installed version: $binary_version"
        echo "Munki version to install: $munki_version"

        # Check binary_version against munki_version
        if compare_versions "$binary_version" "$munki_version"; then
            echo "Older version of 1Password CLI ($binary_version &lt; $munki_version), proceeding with install..."
            exit 0
        else
            echo "Version of 1Password CLI same or newer than the munki version ($binary_version &gt;= $munki_version), skipping..."
            exit 1
        fi
    else
        echo "Encountered an error when ascertaining 1Password CLI version, proceeding with install..."
        exit 0
    fi
else
    echo "Cannot find $binary_path, proceeding with install..."
    exit 0
fi</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/usr/local/bin/op</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/usr</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
