<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the BrowserStackLocal binary and creates a pkg, placing the binary at /usr/local/bin/BrowserStackLocal and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.BrowserStackLocal Binary</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BrowserStackLocalBinary</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>BrowserStackLocal lets you test work-in-progress web and mobile apps at scale without hosting them on public staging environments.</string>
            <key>display_name</key>
            <string>BrowserStackLocal Binary</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.BrowserStackLocal Binary</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installcheck_script</key>
                    <string>#!/bin/zsh

# Copyright 2025, Jamf Software, LLC.

#
# DESCRIPTION
#
# Get browserstacklocal version (if installed)
# Exit 1 if browserstacklocal is installed and newer than what we have in Munki
#

# Function to compare version strings using sort -V
compare_versions() {
    local version1="$1"
    local version2="$2"

    # Use sort -V to compare versions
    local sorted_first=$(printf '%s\n%s\n' "$version1" "$version2" | sort -V | head -n1)

    if [[ "$sorted_first" == "$version1" ]] &amp;&amp; [[ "$version1" != "$version2" ]]; then
        # version1 is strictly less than version2
        return 0
    else
        # version1 is greater than or equal to version2
        return 1
    fi
}

browserstacklocal_binary="/usr/local/bin/BrowserStackLocal"
munki_version="%version%"

# If the binary exists
if [[ -f "$browserstacklocal_binary" ]]; then
    if installed_ver=$("$browserstacklocal_binary" -version 2&gt;/dev/null | grep "BrowserStack Local version" | awk '{print $4}'); then
        if compare_versions "$installed_ver" "$munki_version"; then
            echo "Version of browserstacklocal binary older than the munki version, proceeding with install..."
            exit 0
        else
            echo "Version of browserstacklocal binary same or newer than the munki version, skipping..."
            exit 1
        fi
    else
        echo "Encountered an error when ascertaining browserstacklocal version, proceeding with install..."
        exit 0
    fi
else
    echo "Cannot locate browserstacklocal binary, proceeding with install..."
    exit 0
fi</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
