<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Easymeeting Desktop Client.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Easymeeting Desktop Client</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EasymeetingDesktopClient</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://easymeeting.net/en/easymeeting-3/#lastned</string>
                <key>re_pattern</key>
                <string>(https://download.easymeeting.net/EmDesktopClient-[\S]+\.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Easymeeting Desktop Client.app</string>
                <key>requirement</key>
                <string>identifier "net.easymeeting.desktopclient" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3328T853B3"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
