<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Malwarebytes Breach Remediation-Command Line Interface PKG, and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Malwarebytes Breach Remediation-Command Line Interface</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Malwarebytes Breach Remediation-Command Line Interface</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Malwarebytes Breach Remediation is designed to allow business users to detect and remove malware from endpoints. It is built upon the power of our Malwarebytes Anti-Malware anti-malware client.

Implementation in a portable form provides increased flexibility for IT staff to quickly and easily deploy the client, detect and remediate threats, gather activity logs, and continue with their daily tasks – all with a minimal investment in time and resources.</string>
            <key>developer</key>
            <string>Malwarebytes</string>
            <key>display_name</key>
            <string>Malwarebytes Breach Remediation</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/sh
# This Uninstall Script has been taken unedited from "/Library/Application Support/Malwarebytes/MBBR/Engine.bundle/Contents/Resources/Remove_Malwarebytes.pkg"

# During uninstall we try to do our best. If something fails then we just continue.
# '+e' - allow script execution with non-zero exit status.
set +e

## ----------------------------------------
##              Variables
## ----------------------------------------

MB_PRODUCT_IDENTIFIER="mbbr"
MB_PRODUCT_IDENTIFIER__UPPERCASE="MBBR"
MB_PRODUCT_DOMAIN="com.malwarebytes.${MB_PRODUCT_IDENTIFIER}"
MB_PRODUCT_DOMAIN_SHORT="MB_${MB_PRODUCT_IDENTIFIER__UPPERCASE}"
MB_PRODUCT_INSTALLER="${MB_PRODUCT_DOMAIN}.installer"

APP_SUPPORT_MB="/Library/Application Support/Malwarebytes"
SILO_PATH="${APP_SUPPORT_MB}/${MB_PRODUCT_IDENTIFIER__UPPERCASE}"
LOGS_NAME="Logs"
LOGS_PATH="${SILO_PATH}/${LOGS_NAME}"

AGENT_PLIST_SRC="/Library/LaunchAgents/${MB_PRODUCT_DOMAIN}.frontend.agent.plist"

RTP_DAEMON_JOB_NAME="${MB_PRODUCT_DOMAIN}.rtprotection.daemon"
RTP_DAEMON_PLIST_SRC="/Library/LaunchDaemons/${RTP_DAEMON_JOB_NAME}.plist"

SK_DAEMON_JOB_NAME="${MB_PRODUCT_DOMAIN}.settings.daemon"
SK_DAEMON_PLIST_SRC="/Library/LaunchDaemons/${SK_DAEMON_JOB_NAME}.plist"

MB_PRODUCT_TOOL_NAME="${MB_PRODUCT_DOMAIN}.tool"
MB_PRODUCT_TOOL_SRC="/usr/local/bin/${MB_PRODUCT_TOOL_NAME}"

GUEST_UID=201
LAST_SYSTEM_RESERVED_UID=499

## ----------------------------------------
##          Helper Functions
## ----------------------------------------

stop_agents_and_daemons_function()
{
    # Agents

    echo "Agent unload for All active users from '${AGENT_PLIST_SRC}'..."
    for uid in $(ps -axo uid,args | grep -i "[l]oginwindow.app" | awk '{print $1}'); do
        uid=$(echo $uid | cut -d, -f1)

        if [[ $uid -gt ${LAST_SYSTEM_RESERVED_UID} || $uid -eq ${GUEST_UID} ]]; then
            echo "    UID: $uid"
            launchctl bootout gui/"$uid" "${AGENT_PLIST_SRC}"
        fi
    done
    echo "Agent unloading has been finished."

     # RTP Daemon

    echo "Stopping '${RTP_DAEMON_JOB_NAME}' RTP daemon..."
    launchctl unload "${RTP_DAEMON_PLIST_SRC}"

    # SK Daemon

    echo "Stopping '${SK_DAEMON_JOB_NAME}' SK daemon..."
    launchctl unload "${SK_DAEMON_PLIST_SRC}"
}

forget_product_package_function()
{
    echo "Forgetting product package records..."
    pkgutil --forget "${MB_PRODUCT_INSTALLER}" &amp;&amp; echo "'${MB_PRODUCT_INSTALLER}' package got forgotten." || true
}

remove_product_files_function()
{
    echo "Removing files..."

    # We must not change ownership and permissions of files residing in '&lt;SILO&gt;/Logs' directory.
    # That is why we use 'rm -rf'. See MMAC-1459 for details.
    find "${SILO_PATH}" -d 1 -type d \! -name "${LOGS_NAME}" | \
    while read dir; do
        remove_folder_function "$dir";
    done
    rm -rf "${LOGS_PATH}" || true
    rm -rf "${SILO_PATH}" || true

    remove_file_function "${AGENT_PLIST_SRC}"
    remove_file_function "${RTP_DAEMON_PLIST_SRC}"
    remove_file_function "${SK_DAEMON_PLIST_SRC}"
    remove_file_function "${MB_PRODUCT_TOOL_SRC}"

    forget_product_package_function

    # Removing only in case it's empty.
    rmdir "${APP_SUPPORT_MB}" || true

    remove_launchd_run_counters_function || true
}

# Changes the owner of the file to the needed one and deletes it.
remove_file_function()
{
    # Below we append '|| true' to NOT fail whole script in case of rm/chmod/chown failure which is ok.

    chown 0:0 "$1" || true
    chmod 600 "$1" || true
    rm -f "$1" || true
}

# Changes the owner of the folder to the needed one and deletes it.
remove_folder_function()
{
    # Below we append '|| true' to NOT fail whole script in case of rm/chmod/chown failure which is ok.

    chown -R 0:0 "$1" || true
    chmod -R 600 "$1" || true
    rm -rf "$1" || true
}

get_user_home_folder_function() {

    dscl . read "/Users/$1" NFSHomeDirectory 2&gt;/dev/null | awk '/^NFSHomeDirectory:/ {print $2}' 2&gt;/dev/null || true
}

# Removes launchd run counter file(s) from user's home directory.
remove_launchd_run_counters_function() {

    echo "Removing launchd associated files..."

    # Read list of users.
    dscl . list /Users 2&gt;/dev/null | egrep -v '(^_|^nobody$|^daemon$)' | \
    while read user; do

        user_home=$(get_user_home_folder_function "${user}")
        [ -n "$user_home" ] || continue

        app_support_domain_path="${user_home}/Library/Application Support/${MB_PRODUCT_DOMAIN}"
        [ -d "${app_support_domain_path}" ] || continue

        find "${app_support_domain_path}" -type f -name "${MB_PRODUCT_DOMAIN}.*" | \
        while read path; do
            rm -f "$path" || true
        done

        # Removing only in case it's empty.
        rmdir "${app_support_domain_path}" || true
    done
}

# Removes Malwarebytes users.
remove_malwarebytes_users()
{
    echo "Removing Malwarebytes users..."

    dscl "/Local/Default" -delete "/Users/${MB_PRODUCT_DOMAIN}.nobody" || true
}

# Changing the owner and access rights of the key folders in case they were changed to incorrect previously.
check_owner_of_key_elements()
{
    echo "Checking ownership of key resources..."

    # Below we append '|| true' to NOT fail whole script in case of chmod/chown failure which is ok.

    chown 0:0 "${APP_SUPPORT_MB}" || true
    chmod 755 "${APP_SUPPORT_MB}" || true

    chown 0:0 "${SILO_PATH}" || true
    chmod 755 "${SILO_PATH}" || true
}

## ----------------------------------------
##              Main
## ----------------------------------------

echo "Current user: $(whoami) ($(id -u))"

check_owner_of_key_elements
stop_agents_and_daemons_function || true

remove_malwarebytes_users
remove_product_files_function</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Malwarebytes Breach Remediation-Command Line Interface</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/MBBR.pkg/Payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/Malwarebytes/MBBR/Engine.bundle/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/Malwarebytes/MBBR/Engine.bundle/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>LSMinimumSystemVersion</key>
                    <string>min_os_ver</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%min_os_ver%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/Application Support/Malwarebytes/MBBR/Engine.bundle</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>munkiimport_pkgname</key>
                <string>%NAME%-%version%.pkg</string>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/payload/</string>
                    <string>%RECIPE_CACHE_DIR%/unpack/</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
