<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of MediaMaster Pro 5.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.MediaMaster Pro 5</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MediaMasterPro5</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://cdn\.inmusicbrands\.com/arkaos/downloads/ArKaos_MediaMaster.*?\.dmg</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://support.arkaos.com/index.php/kb/article/117-Last-official-MediaMaster-5-version-download-link</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: ArKaos SA (SKE5HH5VKW)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/ArKaos_MediaMaster*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
