<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Stretchly

To download the Intel version leave the ARCHITECTURE variable blank.

To download the Apple Silicon version use "-arm64" for the ARCHITECTURE variable.
</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Stretchly</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Stretchly</string>
        <key>ARCHITECTURE</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>Stretchly-([0-9]+(\.[0-9]+)+)%ARCHITECTURE%\.dmg</string>
                <key>github_repo</key>
                <string>hovancik/stretchly</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
