<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.munki.VPT8</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>http://nervousvision.com/vpt/vpt8-osx.zip</string>
		<key>NAME</key>
		<string>VPT8</string>
		<key>MUNKI_REPO_SUBDIR</key>
        <string>apps/VPT8</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Video Projection Tool (VPT) is a free multipurpose realtime projection software tool for Mac and Windows.</string>
            <key>display_name</key>
            <string>VPT8</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.haircut.pkg.VPT8</string>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.haircut.download.VPT8</key>
			<dict>
				<key>git_hash</key>
				<string>40edd8a6d9f7333effd631f7f9db5a30b50b8096</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.haircut-recipes/VPT8/VPT8.download.recipe</string>
				<key>sha256_hash</key>
				<string>1d21194cc8fb988f7166c64bea6ea7c6c4001a6953f05d4ad7ec5292fb09030c</string>
			</dict>
			<key>com.github.haircut.pkg.VPT8</key>
			<dict>
				<key>git_hash</key>
				<string>323cb3a04d1c18a7d3f00039cb791cc0f07c932f</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.haircut-recipes/VPT8/VPT8.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>e9fbc113629ba7f4ba15db30477ecdeff10631ca92653e68d645898fb2c6cf0b</string>
			</dict>
		</dict>
	</dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>	
</dict>
</plist>
