<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MediaHuman YouTube Downloader-Trial and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.MediaHuman YouTube Downloader-Trial</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MediaHuman YouTube Downloader-Trial</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>There are so many interesting things to be found on YouTube, but you can't download the videos or save them as audio files by default. That's why we developed YouTube Downloader. This app will help you to accomplish video downloads quickly and without hangups. Using our program you can simply download an entire YouTube playlist or channel at once and watch it whenever and wherever you want.</string>
            <key>developer</key>
            <string>MediaHuman</string>
            <key>display_name</key>
            <string>MediaHuman YouTube Downloader-Trial</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.MediaHuman YouTube Downloader-Trial</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
