<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ARRIRAWConverter 4 disk image.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.ARRIRAWConverter 4</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ARRIRAWConverter4</string>
        <key>MAJOR_OS_VERSION</key>
        <string>14</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.arri.com/en/learn-help/learn-help-camera-system/tools/arriraw-converter</string>
                <key>re_pattern</key>
                <string>href="(/resource/blob/[\S].*/[\S].*/arriraw-converter-gui-4-[\S].*-10-%MAJOR_OS_VERSION%-data.zip)"</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>https://www.arri.com%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzipped/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
    	<dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%destination_path%*/*.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/ARRIRAWConverter.app</string>
                <key>source_path</key>
                <string>%found_filename%/ARRIRAWConverter.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%destination_path%</string>
                <key>requirement</key>
                <string>identifier "com.arri.ARRIRAWConverter" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "34E6756YB7"</string>
                <key>strict_verification</key>
                <true />
            </dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%%found_filename%%</string>
				<key>index</key>
        		<integer>1</integer>
				<key>split_on</key>
				<string>_</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>