<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest trial version of ARRIRAWConverter 4 and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.ARRIRAWConverter 4</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ARRIRAWConverter4</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>The ARRIRAW Converter (ARC) is ARRI`s free reference tool for processing MXF/ARRIRAW or ARRIRAW files to render images of optimal quality. It contains ARRI`s Software Development Kit (SDK) which is also used in the postproduction tools Adobe, Autodesk, Blackmagic, Colorfront, FilmLight, Filmmaster, Nablet AVID AMA PlugIn, The Foundry, and many others.</string>
            <key>display_name</key>
            <string>ARRIRAWConverter 4</string>
            <key>maximum_os_version</key>
            <string>10.15.7</string>
            <key>minimum_os_version</key>
            <string>10.13</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.ARRIRAWConverter 4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
