<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest release of Jamf Connect Verify and imports it in into Munki.</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.munki.Jamf Connect Verify</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Jamf Connect Verify</string>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>NAME</key>
            <string>Jamf Connect Verify</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>Jamf Connect Verify</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Jamf Connect Verify is a menu bar application that allows for continuous password validation between network and local accounts. Validation can occur in the background, avoiding user engagement, or with user interaction.</string>
                <key>developer</key>
                <string>%NAME%</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe has been deprecated following the release of Jamf Connect 2.0</string>
                </dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
            </dict>
            <dict>   
                <key>Processor</key>   
                <string>StopProcessingIf</string>   
                <key>Arguments</key>   
                <dict>   
                    <key>predicate</key>   
                    <string>TRUEPREDICATE</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
