<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Bria Enterprise.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Bria Enterprise</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Bria Enterprise</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.counterpath.com/EnterpriseForMac</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Bria Enterprise.app</string>
                <key>requirement</key>
                <string>identifier "com.CounterPath_Corporation.Bria-Enterprise" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9WJ3F6R925"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>