<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Set ARCHITECTURE to "-arm64" to download for Apple Silicon. Leave blank for Intel.</string>
    <key>Description</key>
    <string>Downloads the latest version of Lens Desktop for Kubernetes.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Lens</string>
    <key>Input</key>
    <dict>
        <key>ARCHITECTURE</key>
        <string></string>
        <key>NAME</key>
        <string>Lens</string>
        <key>CHECK_PAGE_URL</key>
        <string>https://lens-binaries.s3.amazonaws.com/ide/latest-mac.yml</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.51 Safari/537.36</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%CHECK_PAGE_URL%</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>re_pattern</key>
                <string>(Lens-([0-9]+(\.[0-9]+)+)-latest\.([0-9]+(\.[0-9]+)+)%ARCHITECTURE%-mac\.zip)</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://lens-binaries.s3.amazonaws.com/ide/%version%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true></true>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/Lens/Lens.app</string>
                <key>requirement</key>
                <string>identifier "com.electron.kontena-lens" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JJ22T2W355</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
