<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports the latest version of the OpenToonz software into Munki.</string>
     <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.OpenToonz</string>
     <key>Input</key>
    <dict>
            <key>NAME</key>
            <string>OpenToonz</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                            <string>testing</string>
                    </array>
                    <key>description</key>
                    <string>OpenToonz - An open-source full-featured 2D animation creation software</string>
                    <key>developer</key>
                        <string>Toonz</string>
                    <key>display_name</key>
                    <string>OpenToonz</string>
                    <key>name</key>
                    <string>%NAME%</string>
                     <key>unattended_install</key>
                    <true/>
                    <key>unattended_uninstall</key>
                    <true/>
                </dict>
            </dict>
    <key>MinimumVersion</key>
    <string>0.1.0</string>
     <key>ParentRecipe</key>
    <string>com.github.rustymyers.download.opentoonz</string>
     <key>Process</key>
    <array>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                     <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                     <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                     <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/OpenToonzBuild.pkg/Payload</string>
                     <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/Applications/OpenToonz.app/Contents/Info.plist</string>
                     <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                            <key>version</key>
                            <string>%version%</string>
                     </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/payload/</string>
                    <key>installs_item_paths</key>
                    <array>
                            <string>/Applications/OpenToonz.app</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
