<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Exposure X5 and creates a package</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.pkg.Exposure X5</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Exposure X5</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>ParentRecipe</key>
        <string>com.github.dataJAR-recipes.download.Exposure X5</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkgdirs</key>
                    <dict></dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkgdirs</key>
                    <dict></dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/Scripts</string>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%pathname%/Exposure X5 Installer.app/Contents/Resources/files/HD/Applications/Exposure X5.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleVersion</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/Scripts/Exposure X5 Installer.dmg</string>
                    <key>overwrite</key>
                    <true></true>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>file_path</key>
                    <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
                    <key>file_mode</key>
                    <string>0755</string>
                    <key>file_content</key>
                    <string>#!/bin/sh
# Determine working directory
install_dir=$(dirname $0)
# Install the Exposure X5 application using the Install binary's silent install mode
/usr/bin/hdiutil attach "${install_dir}/Exposure X5 Installer.dmg" -nobrowse
"/Volumes/Exposure X5 Installer/Exposure X5 Installer.app/Contents/MacOS/Exposure X5 Installer" -quiet</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>pkgtype</key>
                        <string>flat</string>
                        <key>id</key>
                        <string>com.alienskin.ExposureX5.pkg</string>
                        <key>version</key>
                        <string>%version%</string>
                        <key>scripts</key>
                        <string>Scripts</string>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>