<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Exposure X5</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.Exposure X5</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Exposure X5</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>&lt;h2&gt;(5\.[^a-z]*)&lt;\/h2&gt;</string>
                    <key>result_output_var_name</key>
                    <string>EXPOSURE_VERSION</string>
                    <key>request_headers</key>
                    <dict>
                        <key>user-agent</key>
                        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36</string>
                    </dict>
                    <key>url</key>
                    <string>https://exposure.software/exposure/x5-release-notes/</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>request_headers</key>
                    <dict>
                        <key>user-agent</key>
                        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36</string>
                    </dict>
                    <key>url</key>
                    <string>https://cdn.exposure.software/downloads/exposure-x5-%EXPOSURE_VERSION%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Exposure X5 Installer.app/Contents/Resources/files/HD/Applications/Exposure X5.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.alienskin.exposureX5" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J5B52CMB62)</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>