<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of MakeHuman.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.MakeHuman</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakeHuman</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://download.tuxfamily.org/makehuman/releases/</string>
                <key>re_pattern</key>
                <string>\"(makehuman-community-.*-macos\.zip)\"</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://download.tuxfamily.org/makehuman/releases/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>