<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of mu-editor.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.mu-editor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>mu-editor</string>
		<key>PRERELEASE</key>
        <string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>These recipes have been replaced by: https://github.com/autopkg/dataJAR-recipes/tree/master/Mu%20Editor.</string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>mu-editor/mu</string>
				<key>include_prereleases</key>
				<string>%PRERELEASE%</string>
				<key>asset_regex</key>
				<string>[\S]+\_osx.dmg</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
