<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the TurningPoint web.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.TurningPoint web</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TurningPoint web</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://d2p83s3q5aa83e.cloudfront.net/wp-content/software/TurningPointWeb/TurningPoint-web_Mac.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/TurningPoint web.app</string>
                <key>requirement</key>
                <string>identifier "com.turningtechnologies.TurningPoint-Web" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3YF49VXVT5"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
