<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of JabRef.

To download the Apple Silicon version of the pkg, set DOWNLOAD_ARCH to: "-arm64, and SUPPORTED_ARCH to "arm64".
To download Intel version of the pkg, set DOWNLOAD_ARCH to an empty value, and SUPPORTED_ARCH to "x86_64".

Set PRERELEASE to a non-empty string to download prereleases, either
via Input in an override or via the -k option,
i.e.: `-k PRERELEASE=yes</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.JabRef</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JabRef</string>
        <key>DOWNLOAD_ARCH</key>
        <string></string>
        <key>PRERELEASE</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>include_prereleases</key>
                <string>%PRERELEASE%</string>
                <key>asset_regex</key>
                <string>JabRef-.*?%DOWNLOAD_ARCH%.pkg</string>
                <key>github_repo</key>
                <string>JabRef/jabref</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: JabRef e.V. (6792V39SK3)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>