<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of MediaMaster Pro.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.MediaMaster Pro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MediaMasterPro</string>
        <key>DOWNLOAD_URL</key>
        <string>https://pro.arkaos.com/downloads/mediamaster_mac.php</string>        
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    	<dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/ArKaos_MediaMaster*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%dmg_found_filename%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: ArKaos SA (SKE5HH5VKW)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>            
            </dict>
        </dict>
    </array>
</dict>
</plist>
