<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of XAMPP</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-test-recipes.download.XAMPP</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>XAMPP</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>href="(https://sourceforge.net/projects/xampp/files/XAMPP%20Mac%20OS%20X/([0-9]+(.[0-9]+)+)/xampp-osx-([0-9]+(.[0-9]+)+)-\d-installer.dmg)"</string>
                    <key>result_output_var_name</key>
                    <string>match</string>
                    <key>url</key>
                    <string>https://www.apachefriends.org/download.html</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
