<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Balsamiq Wireframes 4.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Balsamiq Wireframes 4</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BalsamiqWireframes4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://builds.balsamiq.com/bwd/mac.jsonp</string>
                <key>re_pattern</key>
                <string>version\":\"(4\..*?)\"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://build_archives.s3.amazonaws.com/Wireframes-macOS/Balsamiq%20Wireframes%20%match%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Balsamiq Wireframes.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.balsamiq.wireframes" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3DPKD72KQ7")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
