<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of the Focusrite Control</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Focusrite Control</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Focusrite Control</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://customer.focusrite.com/en/support/downloads?brand=Focusrite&amp;product_by_type=1359&amp;download_type=software</string>
                <key>re_pattern</key>
                <string>https:\/\/fael-downloads-prod\.focusrite\.com\/customer\/prod\/s3fs-public\/downloads\/Focusrite\S.*\.dmg</string>
                <key>result_output_var_name</key>
				<string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Focusrite Control.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Focusrite Audio Engineering Ltd. (7VYBQV3T2Q)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>