<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of VeraCrypt.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.VeraCrypt</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VeraCrypt</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\&quot;https://launchpad\.net/veracrypt/trunk/([0-9]+(\.[0-9]+)+)/&amp;#43;download/VeraCrypt_([0-9]+(\.[0-9]+)+)\.dmg\&quot;</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_VERSION</string>
                <key>url</key>
                <string>https://www.veracrypt.fr/en/Downloads.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://launchpad.net/veracrypt/trunk/%DOWNLOAD_VERSION%/+download/VeraCrypt_%DOWNLOAD_VERSION%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: IDRIX (Z933746L2S)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/VeraCrypt_Installer.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
