<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest trial version of JPEGmini.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.JPEGmini-Trial</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>JPEGmini-Trial</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://mac.jpegmini.com/autoupdate/JPEGmini-appcast.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>JPEGmini only comes in the Pro variety now, please use: https://github.com/autopkg/dataJAR-recipes/tree/master/JPEGmini%20Pro-Trial</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
	</array>
</dict>
</plist>
