<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of EyeJack Creator 2021</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.EyeJack Creator 2021</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EyeJack Creator 2021</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe has been deprecated. EyeJack Creator 2021 is now EyeJack Creator 2022 please move to the new recipes here: https://github.com/autopkg/dataJAR-recipes/tree/master/EyeJack%20Creator%202022</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>EyeJack Creator (2021\S*\.dmg)</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://s3.amazonaws.com/eyejack-creator-2020/prd/mac/latest-mac.yml</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://s3.amazonaws.com/eyejack-creator-2020/prd/mac/EyeJack+Creator+%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/EyeJack Creator 2021.app</string>
                <key>requirement</key>
                <string>identifier "com.eyejackapp.creator" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "69N5JPMK3Q"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
