<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of the Wondershare Filmora.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Wondershare Filmora</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WondershareFilmora</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The .app is now Wondershare Filmora X.app and not Wondershare Filmora.app, and OS requirements have changed. Created new recipes for this new .app: https://github.com/autopkg/dataJAR-recipes/tree/master/Wondershare%20Filmora%20X.</string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>http://download\.wondershare\.com/upgrade/filmora-mac_full.*?\.dmg</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://cbs.wondershare.com/go.php?m=upgrade_info&amp;pid=718</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Wondershare Filmora.app</string>
                <key>requirement</key>
                <string>identifier "com.wondershare.filmora" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = YZC2T44ZDX</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>