<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Inquisit Lab and imports into munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Inquisit Lab</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>InquisitLab</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Development</string>
            <key>description</key>
            <string>Inquisit Lab is a powerful tool for designing and administering rich psychological tests and experiments on dedicated computers, whether in the lab, the clinic, or out in the field. Use any of the tests in the Millisecond Test Library, customize them, or program your own.</string>
            <key>developer</key>
            <string>Millisecond Software</string>
            <key>display_name</key>
            <string>Inquisit Lab %MAJOR_VERSION%</string>
            <key>name</key>
            <string>%NAME%%MAJOR_VERSION%</string>
            <key>unattended_install</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash
# Unload kexts
/sbin/kextunload -q -b com.millisecond.driver.InquisitParallelPort

# Delete app bundle
if [ -d /Applications/Inquisit\ %MAJOR_VERSION%.app ]
then
    /bin/rm -rf /Applications/Inquisit\ %MAJOR_VERSION%.app
fi

# Delete Library kext
if [ -d /Library/Extensions/InquisitParallelPort.kext ]
then
    /bin/rm -rf /Library/Extensions/InquisitParallelPort.kext
fi

# Delete System kext
if [ -d /System/Library/Extensions/InquisitParallelPort.kext ]
then
    /bin/rm -rf /System/Library/Extensions/InquisitParallelPort.kext
fi</string>
        </dict>
    </dict>
      <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Inquisit Lab</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
