<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for Scratch 3</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.Scratch 3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Scratch 3</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_2) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0.2 Safari/605.1.15</string>
		<key>baseurl</key>
		<string>https://scratch.mit.edu</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>%USER_AGENT%</string>
				</dict>
				<key>url</key>
				<string>%baseurl%/js/download.bundle.js</string>
				<key>re_pattern</key>
				<string>(https://downloads.scratch.mit.edu/desktop/Scratch.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
			   <key>filename</key>
			   <string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
	<key>Processor</key>
	<string>CodeSignatureVerifier</string>
	<key>Arguments</key>
	<dict>
		<key>input_path</key>
		<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Scratch 3.app</string>
		<key>requirement</key>
		<string>identifier "edu.mit.scratch.scratch-desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W7AR3WMP87</string>
	</dict>
</dict>
	</array>
</dict>
</plist>