<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of CsoundQt and exports package.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.pkg.CsoundQt</string>
	<key>Input</key>
	<dict>
	    <key>BUNDLE_ID</key>
    	<string>com.csound.csoundqt</string>
		<key>NAME</key>
		<string>CsoundQt</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Csound</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/CsoundQt-*-OSX.dmg</string>
            </dict>
        </dict>
	    <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/CsoundQt-*-OSX.dmg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/</string>
            </dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%dmg_found_filename%</string>
				<key>index</key>
        		<integer>1</integer>
				<key>split_on</key>
				<string>-</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%dmg_found_filename%/CsoundQt-d-py-cs6.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/CsoundQt-d-py-cs6.app</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%BUNDLE_ID%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
