<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Apple's Mastering Tools.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Apple Mastering Tools</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mastering Tools</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                 <key>url</key>
                 <string>https://images.apple.com/itunes/mastered-for-itunes/docs/apple_audio_mastering_tools_v10.9_greater.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/extract/</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%pkgroot%</string>
                <key>purge_destination</key>
                <true/>
                <key>archive_format</key>
                <string>zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pkgroot%Apple Audio Mastering Tools.dmg/Droplets/Audio to WAVE 96K Droplet.app</string>
                <key>requirement</key>
                <string>identifier "com.apple.itunes.AudiotoWAVE96kdroplet" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "292CA77D2D"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pkgroot%Apple Audio Mastering Tools.dmg/Droplets/Audio to WAVE Droplet.app</string>
                <key>requirement</key>
                <string>identifier "com.apple.itunes.AudiotoWAVEdroplet" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "292CA77D2D"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pkgroot%Apple Audio Mastering Tools.dmg/Droplets/Master for iTunes Droplet.app</string>
                <key>requirement</key>
                <string>identifier "com.apple.itunes.masterforitunesdroplet" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "292CA77D2D"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
