<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Malwarebytes Breach Remediation - Command Line Interface PKG, and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Malwarebytes Breach Remediation - Command Line Interface</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>mbbr</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Malwarebytes Breach Remediation - Command Line Interface</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unzip/</string>                                 
                </array>
            </dict>
        </dict> 
    </array>
</dict>
</plist>