<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest LTS version of Node.js.

MAJOR_VERSION needs to be one of the 'latest-v' version numbers listed here: https://nodejs.org/dist/</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.nodejslts</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>nodelts</string>
            <key>MAJOR_VERSION</key>
            <string>20</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://nodejs.org/dist/latest-v%MAJOR_VERSION%.x/</string>
                    <key>re_pattern</key>
                    <string>node-v%MAJOR_VERSION%.([0-9]+(\.[0-9]+)+).pkg</string>
                    <key>result_output_var_name</key>
                    <string>MINOR_VERSION</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://nodejs.org/dist/latest-v%MAJOR_VERSION%.x/node-v%MAJOR_VERSION%.%MINOR_VERSION%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Node.js Foundation (HX7739G8FX)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
