<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of XAMPP</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.XAMPP</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>XAMPP</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe has been deprecated. The XAMPP VM App is no longer availabe from the vendor. Please remove from your runs.</string>
                </dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>predicate</key>
                    <string>TRUEPREDICATE</string>
                </dict>
                <key>Processor</key>
                <string>StopProcessingIf</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>href=\"(https://sourceforge\.net/projects/xampp/files/XAMPP%20Mac%20OS%20X/(\d(\.\d)+)/xampp-osx-(\d(\.\d)+)-[0-9]+-vm\.dmg)\"</string>
                    <key>result_output_var_name</key>
                    <string>match</string>
                    <key>url</key>
                    <string>https://www.apachefriends.org/download.html</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/xampp-osx-*.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.bitnami.stackman" and certificate leaf[subject.OU] = "49P7N62XPM"</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
