<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Insomnia Core.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Insomnia Core</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>InsomniaCore</string>
        <key>DOWNLOAD_URL</key>
        <string>https://updates.insomnia.rest/downloads/mac/latest?app=com.insomnia.app&amp;ref=</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Insomnia.app</string>
                <key>requirement</key>
                <string>identifier "com.insomnia.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FX44YY62GV</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
