<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Fathom.

Note: The following values have changed!
To download Apple Silicon use: "dmg_arm64" in the DOWNLOAD_ARCH variable
To download Intel use: "dmg" in the DOWNLOAD_ARCH variable</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Fathom</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_ARCH</key>
        <string>dmg</string>
        <key>NAME</key>
        <string>Fathom</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://electron-update.fathom.video/download/%DOWNLOAD_ARCH%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Fathom.app</string>
                <key>requirement</key>
                <string>identifier "video.fathom.electron" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JH7GAYKCUH</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
