<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ProtonVPN.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.ProtonVPN</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ProtonVPN</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>url="(https://vpn\.protondownload\.com/download/macos/([0-9]+(\.[0-9]+)+)/ProtonVPN_mac_v([0-9]+(\.[0-9]+)+)\.dmg)"</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
                <key>url</key>
                <string>https://protonvpn.com/download/macos-update5.xml</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/ProtonVPN.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "ch.protonvpn.mac" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6S6Q257EK)</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
