<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Keeper Password Manager and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.KeeperPasswordManager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KeeperPasswordManager</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Keeper protects your passwords and secrets with ultimate security, visibility and control

From the data center to the front office, Keeper delivers the ultimate in enterprise security and cyberthreat prevention. Protect access to applications, systems, secrets and IT resources with a zero-trust and zero-knowledge architecture. Simplify and strengthen auditing and compliance while achieving organisation-wide visibility, control, event logging and reporting.</string>
            <key>developer</key>
            <string>Callpod Inc.</string>
            <key>display_name</key>
            <string>Keeper Password Manager</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.KeeperPasswordManager</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
