<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of FL Studio 2024.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.FL Studio 2024</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FLStudio2024</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.0 Safari/605.1.15</string>
                    <key>Referer</key>
                    <string>https://www.image-line.com/</string>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Sec-Fetch-Site</key>
                    <string>none</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>navigate</string>
                    <key>Accept-Language</key>
                    <string>en-GB,en;q=0.9</string>
                    <key>Sec-Fetch-Dest</key>
                    <string>document</string>
                    <key>Priority</key>
                    <string>u=0, i</string>
                </dict>
                <key>re_pattern</key>
                <string>href=\"(https://support.image-line.com/redirect/flstudio_mac.*?)\"</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
                <key>url</key>
                <string>https://www.image-line.com/fl-studio-download/</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.0 Safari/605.1.15</string>
                    <key>Referer</key>
                    <string>https://www.image-line.com/</string>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Sec-Fetch-Site</key>
                    <string>none</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>navigate</string>
                    <key>Accept-Language</key>
                    <string>en-GB,en;q=0.9</string>
                    <key>Sec-Fetch-Dest</key>
                    <string>document</string>
                    <key>Priority</key>
                    <string>u=0, i</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: image-line (N68WEP5ZZZ)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/Install FL Studio.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
