<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of JDiskReport.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.JDiskReport</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FlashPrint</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>Windows 32-bit installer&lt;/a&gt;, &lt;a href=\"(http://www\.jgoodies\.com/download/jdiskreport/jdiskreport-.*?-mac\.zip)\"&gt;Mac OS X</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://www.jgoodies.com/downloads/jdiskreport/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>