<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest stable KeePassXC.

To download Apple Silicon use: "arm64" in the DOWNLOAD_ARCH variable
To download Intel use: "x86_64" in the DOWNLOAD_ARCH variable</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.KeePassXC</string>
        <key>Input</key>
        <dict>
            <key>DOWNLOAD_ARCH</key>
            <string>x86_64</string>
            <key>NAME</key>
            <string>KeePassXC</string>
            <key>PRERELEASE</key>
            <string></string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>github_repo</key>
                    <string>keepassxreboot/keepassxc</string>
                    <key>include_prereleases</key>
                    <string>%PRERELEASE%</string>
                    <key>asset_regex</key>
                    <string>KeePassXC-([0-9]+(.[0-9]+)+)-%DOWNLOAD_ARCH%.dmg$</string>
                </dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%-%DOWNLOAD_ARCH%-%version%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/KeePassXC.app</string>
                    <key>requirement</key>
                    <string>identifier "org.keepassxc.keepassxc" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = G2S7P7J672</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
