<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Waves Central and imports into Munki</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.WavesCentral</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>WavesCentral</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Use Waves Central to install and activate the latest version of Waves products.</string>
            <key>developer</key>
            <string>Waves</string>
            <key>display_name</key>
            <string>Waves Central</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
#
# Pinched with &lt;3 from: https://github.com/autopkg/moofit-recipes/blob/master/Waves%20Audio/WavesCentral.pkg.recipe#L64-L70
#

/bin/mkdir -p /Library/Application\ Support/Waves/Licenses
/bin/mkdir -p /Applications/Waves/Data/Instrument\ Data/Waves\ Sample\ Libraries

/bin/chmod -R 777 /Library/Application\ Support/Waves/
/bin/chmod -R 777 /Applications/Waves</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.download.WavesCentral</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
