<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports the latest version of the Poll Everywhere client into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Poll Everywhere</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PollEverywhere</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Capture powerful feedback instantly during virtual meetings, classes, events, and more.</string>
                <key>developer</key>
                <string>Poll Everywhere</string>
                <key>display_name</key>
                <string>Poll Everywhere</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
    <key>MinimumVersion</key>
    <string>0.1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Poll Everywhere</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
