<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe of the Axure RP 10 Trial.

NOTE: Axure has created two binaries for Intel and ARM hardware.
Modify the architecture  in your override to accomodate accordingly.

Set ARCHITECTURE to "-arm64" to download for Apple Silicon. Leave blank for Intel.
    </string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Axure RP 10-Trial</string>
    <key>Input</key>
    <dict>
        <key>ARCHITECTURE</key>
        <string>-arm64</string>
        <key>NAME</key>
        <string>AxureRP10-Trial</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://axure.cachefly.net/versions/10-0/AxureRP-Setup%ARCHITECTURE%-[\d+]+\.dmg</string>
                <key>url</key>
                <string>https://www.axure.com/release-history/rp10</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Axure RP 10.app</string>
                <key>requirement</key>
                <string>identifier "com.axure.AxureRP10" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HUMW6UU796</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
