<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of rekordbox 6</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.rekordbox 6</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>rekordbox6</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.114 Safari/537.36</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>request_headers</key>
                    <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                    </dict>
                    <key>re_pattern</key>
                    <string>https://cdn\.rekordbox\.com/files/.*/Install_rekordbox_6.*\.pkg_\.zip</string>
                    <key>result_output_var_name</key>
                    <string>match</string>
                    <key>url</key>
                    <string>https://rekordbox.com/en/download/</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unzip</string>
                    <key>purge_destination</key>
                    <true></true>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/unzip/*.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%found_filename%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: AlphaTheta Corporation (6BRHGXQ6VU)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
