<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.munki.flowsync</string>
	<key>Description</key>
    <string>Downloads the current release version of Polar FlowSync and imports it to Munki.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FlowSync</string>
		<key>MUNKI_REPO_SUBDIR</key>
        <string>Applications</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Applications</string>
            <key>description</key>
            <string>Install FlowSync to sync all your training sessions and activity data with the Polar Flow web service for more in-depth analysis.</string>
            <key>developer</key>
            <string>Polar</string>
            <key>display_name</key>
            <string>FlowSync</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstallable</key>
            <true/>
        </dict>        
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.flowsync</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
