<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Sony SxS driver disk image.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.SonySxSDriver</string>
    <key>Input</key>
    <dict>
        <key>DEVELOPER</key>
        <string>Sony</string>
        <key>NAME</key>
        <string>SxSDriver</string>
        <key>PRODUCTID</key>
        <string>11297.0</string>
        <key>DOWNLOADURL</key>
        <string>https://www.sonycreativesoftware.com/download/link?id=%PRODUCTID%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%DEVELOPER%-%NAME%.dmg</string>
                <key>url</key>
                <string>%DOWNLOADURL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Sony Storage Media Solutions Corporation (BFWBPTF4M3)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
