<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Sony SxS driver disk image.</string>
        <key>Identifier</key>
      <string>com.github.dataJAR-recipes.download.SonySxSDriver</string>
        <key>MinimumVersion</key>
      <string>1.0.0</string>
        <key>Input</key>
        <dict>
        <key>NAME</key>
         <string>SxSDriver</string>
        <key>DEVELOPER</key>
         <string>Sony</string>
        <key>PRODUCTID</key>
         <string>11297.0</string>
        <key>DOWNLOADURL</key>
         <string>https://www.sonycreativesoftware.com/download/link?id=%PRODUCTID%</string>
        </dict>
        <key>Process</key>
        <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
               <string>%DOWNLOADURL%</string>
                <key>filename</key>
               <string>%DEVELOPER%-%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Sony Storage Media Solutions Corporation (BFWBPTF4M3)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        </array>
    </dict>
</plist>
