<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Milanote 1 and then uploads to the JSS</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.jss.Milanote 1</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Applications</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
        <string>Axure RP 8-Trial-SmartGroupTemplate.xml</string>
        <key>NAME</key>
        <string>Milanote1</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>PolicyTemplate.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>Create simple click-through diagrams or highly functional, rich prototypes with conditional logic, dynamic content, animations, math functions, and data-driven interactions without writing a single line of code.</string>
        <key>SELF_SERVICE_ICON</key>
        <string>Milanote1.png</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.Milanote 1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>extension_attributes</key>
                <array>
                    <dict>
                        <key>ext_attribute_path</key>
                        <string>Axure RP 8-Trial-CFBundleVersionExtensionAttribute.xml</string>
                    </dict>
                </array>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>prod_name</key>
                <string>Milanote</string>
                <key>self_service_description</key>
                <string>%SELF_SERVICE_DESCRIPTION%</string>
                <key>self_service_icon</key>
                <string>%SELF_SERVICE_ICON%</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>