<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Anaconda for Python 3 and imports it into Munki.

This differs from other recipes as we pull the version out of a .json file instead of the pkg receipts, as
the pkg receipts are all 0.

This is accomplished via our own custom processor (JSONFileReader) and an installcheck_script</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Anaconda 3</string>
    <key>Input</key>
    <dict>
        <key>INSTALLER_TYPE</key>
        <string>pkg</string>
        <key>PYTHON_MAJOR_VERSION</key>
        <string>3</string>
        <key>MUNKI_CATALOGS</key>
        <string>testing</string>
        <key>MUNKI_CATEGORY</key>
        <string>Science</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Continuum</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%/</string>
        <key>NAME</key>
        <string>Anaconda3</string>
        <key>DISPLAY_NAME</key>
        <string>Anaconda 3</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>%MUNKI_CATALOGS%</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Anaconda is a Python distribution which includes over 400 Python packages for science, math, engineering, and data analysis.</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postuninstall_script</key>
            <string>#!/bin/bash
rm -rf "/Applications/Anaconda-Navigator.app"</string>
            <key>uninstall_method</key>
            <string>removepackages</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.Anaconda</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe has been deprecated. The vendor only supports user space installs. Please see https://docs.anaconda.com/free/anaconda/install/mac-os/</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                 <key>destination_path</key>
                 <string>%RECIPE_CACHE_DIR%/unpack</string>
                 <key>flat_pkg_path</key>
                 <string>%pathname%</string>
                 <key>purge_destination</key>
                 <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                 <key>destination_path</key>
                 <string>%RECIPE_CACHE_DIR%/tmp/</string>
                 <key>pkg_payload_path</key>
                 <string>%RECIPE_CACHE_DIR%/unpack/prepare_installation.pkg/Payload</string>
                 <key>purge_destination</key>
                 <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/tmp/anaconda3/tmp.tar</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/tar/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/tar/pkgs/anaconda-*.tar.bz2</string>
            </dict>
         </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_format</key>
                <string>tar</string>
                <key>archive_path</key>
                <string>%found_filename%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/info/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.dataJAR-recipes.Shared Processors/JSONFileReader</string>
            <key>Arguments</key>
            <dict>
                <key>json_key</key>
                <string>conda_version</string>
                <key>json_path</key>
                <string>%RECIPE_CACHE_DIR%/info/info/about.json</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/info</string>
                    <string>%RECIPE_CACHE_DIR%/tar</string>
                    <string>%RECIPE_CACHE_DIR%/tmp</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
