<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of BlueJeansAdminInstaller.

This package also installs the Blue Jeans sound driver

More Details on the Admin installer: https://support.bluejeans.com/s/article/BlueJeans-App-2-x-Centralized-Deployment

To download the Apple Silicon version use arm64 in the ARCH_TYPE variable.

To download the Intel version use x86_64 in the ARCH_TYPE variable.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Blue Jeans Admin Installer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BlueJeans</string>
        <key>ARCH_TYPE</key>
        <string>x86_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>enclosure url=\"https://swdl\.bluejeans\.com/desktop-app/mac/(([0-9]+(\.[0-9]+)+)/([0-9]+(\.[0-9]+)+))/blue</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_VERSION</string>
                <key>url</key>
                <string>https://swdl.bluejeans.com/desktop-app/mac/ga.appcast.xml</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://swdl.bluejeans.com/desktop-app/mac/%DOWNLOAD_VERSION%/BlueJeansAdminInstaller(%ARCH_TYPE%).pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Blue Jeans Network, Inc. (HE4P42JBGN)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
