<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Admin Installer for Blue Jeans and imports it into Munki. This package also installs the Blue Jeans sound driver
	More Details on the Admin installer: https://support.bluejeans.com/s/article/BlueJeans-App-2-x-Centralized-Deployment</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Blue Jeans Admin Installer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Blue Jeans Admin Installer</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
			<string>BlueJeans video conferencing application and sound driver</string>
            <key>developer</key>
			<string>Bluejeans</string>
            <key>display_name</key>
            <string>Blue Jeans</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Blue Jeans Admin Installer</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
    </array>
</dict>
</plist>
