<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of amaran Desktop.

To download Apple Silicon use: "arm64" in the DOWNLOAD_ARCH variable
To download Intel use: "x86_64" in the DOWNLOAD_ARCH variable</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.amaran Desktop</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_ARCH</key>
        <string>arm64</string>
        <key>NAME</key>
        <string>amaranDesktop</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://s3.sidus.link/amaranDesktop/amaran-darwin-%DOWNLOAD_ARCH%-signed.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Sidus Link Ltd. (XP3H66JF79)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
