<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Gladinet Cloud Mac Client 9 dmg and then uploads to the JSS</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.jss.Gladinet Cloud Mac Client</string>
    <key>Input</key>
    <dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Gladinet Cloud Mac Client</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Gladinet Cloud Mac OS X client integrates with Mac Finder with a drive volume. Inside the drive volume, you can see the backend storage files and folders from Gladinet Cloud Enterprise.</string>
        <key>SELF_SERVICE_ICON</key>
		<string>GladinetCloudMacClient.png</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.Gladinet Cloud Mac Client</string>
    <key>Process</key>
    <array>
        <dict>
        	<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>purge_destination</key>
				<string>true</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
                <key>pkgdirs</key>
                <dict>
					<key>Applications</key>
					<string>0755</string>
				</dict>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/GladinetClient.pkg/Payload</string>
				<key>purge_destination</key>
				<string>true</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/application_payload/Applications/Cloud Drive.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>pkg_path</key>
				<string>%target%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>Cloud Drive</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                	<string>%RECIPE_CACHE_DIR%/application_payload/</string>
                	<string>%RECIPE_CACHE_DIR%/unpack</string>                              
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
