<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Positron.

To download Apple Silicon use: "arm64" in the DOWNLOAD_ARCH variable
To download Intel use: "x64" in the DOWNLOAD_ARCH variable</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Positron</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_ARCH</key>
        <string>arm64</string>
        <key>NAME</key>
        <string>Positron</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(https://cdn\.posit\.co/positron/releases/mac/%DOWNLOAD_ARCH%/Positron-([0-9]+(\.[0-9]+)+)-[0-9]+-%DOWNLOAD_ARCH%\.dmg)\"</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
                <key>url</key>
                <string>https://positron.posit.co/download.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Positron.app</string>
                <key>requirement</key>
                <string>identifier "co.posit.positron" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FYF2F5GFX4</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
