<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Isadora 3.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Isadora 3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Isadora3</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                  <key>re_pattern</key>
                  <string>/files/isadoramac-3.*-std\.dmg</string>
                  <key>result_output_var_name</key>
                  <string>match</string>
                  <key>url</key>
                  <string>https://troikatronix.com/get-it/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://troikatronix.com/%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>   
			<key>Processor</key>   
			<string>CodeSignatureVerifier</string>   
			<key>Arguments</key>   
			<dict>   
				<key>input_path</key>   
				<string>%pathname%/Isadora Installer.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Mark Coniglio (Q5V96MD6S6)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
