<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of WaveLab LE 9 and imports into Munki.
    
    WaveLab LE 9.5 whilst an update for this, it is also a seperate .app so there are new recipes at:
    
    https://github.com/autopkg/dataJAR-recipes/tree/master/WaveLab%20LE%209.5</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.munki.WaveLab LE 9</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WaveLab LE 9</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>WaveLab LE 9.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>WaveLab Elements is an audio editing and mastering software, perfectly tailored to hobby musicians, radio freelancers and home studio owners. Based on the approved WaveLab Pro mastering solution, the WaveLab Elements highlights proven editing and analysis tools, a valuable selection of restoration and mastering plug-ins, a CD burning engine and much more — all accessible through an intuitive user interface.</string>
			<key>display_name</key>
			<string>WaveLab LE 9</string>
			<key>developer</key>
			<string>Steinberg Media Technologies GmbH</string>
			<key>minimum_os_version</key>
			<string>10.11</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.WaveLab LE 9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/application_payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/WaveLab LE 9.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                <string>%RECIPE_CACHE_DIR%/application_payload/</string>
                <string>%RECIPE_CACHE_DIR%/unpack</string>                              
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict> 
	</array>
</dict>
</plist>
