<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of krisp

NOTE: This recipe downloads the Intel version of krisp. I haven't found a download URL for
the Apple Silicon version, but it should work under Rosetta 2.

NOTE 2: This recipe downloads the Pro/Free version of krisp. I haven't found a download
URL for the Enterprise version. Both versions use the same package receipt, though, so do
NOT use this recipe if you are on an Enterprise plan or it will overwrite your app.</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.download.krisp</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>krisp</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                    <key>url</key>
                    <string>https://download.krisp.ai/mac</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Krisp Technologies, Inc. (U5R26XM5Z2)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
