<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the OpenVPN Connect Client 3 for Mac.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.OpenVPN Connect Client 3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenVPNConnectClient3</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.0 Safari/605.1.15</string>
                    <key>Referer</key>
                    <string>https://openvpn.net/client-connect-vpn-for-mac-os/;auto</string>
                </dict>
                <key>url</key>
                <string>https://openvpn.net/downloads/openvpn-connect-v3-macos.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/OpenVPN_Connect*%ARCH%*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: OPENVPN TECHNOLOGIES, INC. (ACV7L3WCD8)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
