<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ZAP.

To download Apple Silicon use: "_aarch64" in the DOWNLOAD_ARCH variable
To download Intel leave the DOWNLOAD_ARCH variable empty</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.ZAP</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_ARCH</key>
        <string>_aarch64</string>
        <key>NAME</key>
        <string>ZAP</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>ZAP_([0-9]+(\.[0-9]+)+)%DOWNLOAD_ARCH%\.dmg$</string>
                <key>github_repo</key>
                <string>zaproxy/zaproxy</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
