<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest pkg installer of Valhalla Supermassive.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Valhalla Supermassive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ValhallaSupermassive</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\"(https://valhallaproduction\.s3\.us-west-2\.amazonaws\.com/supermassive/ValhallaSupermassiveOSX.*?\.dmg)\"</string>
                <key>url</key>
                <string>https://valhalladsp.com/demos-downloads/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/ValhallaSupermassiveOSX.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pkg_path%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Valhalla DSP, LLC (8MV85B4Z2E)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
