<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of the Show Me Your ID 3.0.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Show Me Your ID 3.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShowMeYourID3.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
                    <key>Referer</key>
                    <string>https://hcsonline.com/support/apps;auto</string>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Sec-Fetch-Site</key>
                    <string>same-origin</string>
                    <key>Sec-Fetch-Dest</key>
                    <string>document</string>
                    <key>Accept-Language</key>
                    <string>en-GB,en;q=0.9</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>navigate</string>
                    <key>Host</key>
                    <string>hcsonline.com</string>
                    <key>Accept-Encoding</key>
                    <string>gzip, deflate, br</string>
                    <key>Connection</key>
                    <string>keep-alive</string>
                </dict>
                <key>re_pattern</key>
                <string>\"(/images/Apps/Show_Me_Your_ID_3_0.*?\.zip)\"</string>
                <key>url</key>
                <string>https://hcsonline.com/support/apps/show-me-your-id</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
                    <key>Referer</key>
                    <string>https://hcsonline.com/support/apps/show-me-your-id;auto</string>
                    <key>Accept</key>
                    <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                    <key>Sec-Fetch-Site</key>
                    <string>same-origin</string>
                    <key>Sec-Fetch-Dest</key>
                    <string>document</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>navigate</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>https://hcsonline.com%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%destination_path%/Show Me Your ID 3.0.app</string>
                <key>requirement</key>
                <string>identifier "com.hcs.ShowMeYourID3.0" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = K7H6BHYE53</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
