<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest US-20x20 Settings Panel installer.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipe.download.US-20x20SettingsPanel</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>US-20x20_SettingsPanel</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.tascam.eu/en/downloads/US-20x20</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_2) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0.2 Safari/605.1.15</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;sw/us-20x20/US-20x20_mac_sp_v.*?.zip)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                        <key>User-Agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                 <key>url</key>
                <string>https://www.tascam.eu/%match%</string>               
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>

