<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of LXFree and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipe.munki.US-20x20SettingsPanel</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>US-20x20_SettingsPanel</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.tascam.eu/en/downloads/US-20x20</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_2) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0.2 Safari/605.1.15</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
			<string>US-20x20 - 20-Channel USB Audio Interface / Digital Mixer Settings Panel</string>
            <key>developer</key>
			<string>Tascam</string>
            <key>display_name</key>
            <string>US-20x20_SettingsPanel</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
     <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipe.download.US-20x20SettingsPanel</string>
    <key>Process</key>
    <array> 
    <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>purge_destination</key>
            <true/>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
            <key>pattern</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/US-20x20_*.dmg</string>
        </dict>
    </dict> 
    <dict>
		<key>Processor</key>
        <string>FlatPkgUnpacker</string>
        <key>Arguments</key>
        <dict>
           <key>flat_pkg_path</key>
           <string>%found_filename%/US-20x20.pkg</string>
           <key>destination_path</key>
           <string>%RECIPE_CACHE_DIR%/unpack</string>
        </dict>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>pkg_payload_path</key>
            <string>%RECIPE_CACHE_DIR%/unpack/Settings Panel.pkg/Payload</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/unpack/root</string>
        </dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
    </dict> 
  	<dict>
		<key>Arguments</key>
		<dict>
			<key>faux_root</key>
			<string>%RECIPE_CACHE_DIR%/unpack/root</string>
			<key>installs_item_paths</key>
			<array>
				<string>/Applications/US-20x20_SettingsPanel.app</string>
			</array>
		</dict>
		<key>Comment</key>
		<string>Use processor to obtain hashes.</string>
		<key>Processor</key>
		<string>MunkiInstallsItemsCreator</string>
	</dict>   
    <dict>
    	<key>Processor</key>
    	<string>MunkiPkginfoMerger</string>
    </dict>     
	<dict>
		<key>Arguments</key>
		<dict>
			<key>pkg_path</key>
			<string>%found_filename%/US-20x20.pkg</string>
			<key>repo_subdirectory</key>
			<string>%MUNKI_REPO_SUBDIR%</string>
		</dict>
		<key>Processor</key>
		<string>MunkiImporter</string>
	</dict>
    </array>
</dict>
</plist>
