<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Kaspersky Network Agent.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Kaspersky Network Agent</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KasperskyNetworkAgent</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe no longer works, and as such has been deprecated. The product seems to have had 3 major updates since this recipe was written, and cannot find a way to download the latest release at the time or writing this.</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>curl_opts</key>
                <array>
                    <string>--data-binary</string>
                    <string>[{"codename":"kesmac10","typename":"Build","TypeExtension":"Network agent","site":"https://www.kaspersky.com"}]</string>
                </array>
                <key>re_pattern</key>
                <string>https:\/\/products\.s\.kaspersky-labs\.com\/workstations\/kesmac10\/\S*\/multilanguage-INT-\S*klnagentmac1\S*\.zip</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://api-router.kaspersky-labs.com/downloads/search</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>curl_opts</key>
                <array/>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Kaspersky Lab UK Limited (2Y8XE5CQ94)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%destination_path%/klnagentmac.dmg/Kaspersky Network Agent.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
