<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of CrashPlan for Enterprise 6 and extracts the Pkg</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.CrashPlan for Enterprise 6</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CrashPlanForEnterprise6</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>"Previous versions are no longer supported. If you need to download an older version, contact our Customer Champions for support." from - https://support.code42.com/Administrator/6/Planning_And_Installing/Code42_server_and_app_downloads</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"(https://download\.code42\.com/installs/mac/install/Code42CrashPlan/Code42CrashPlan_6.*_Mac\.dmg)\"</string>
                <key>url</key>
                <string>https://support.code42.com/Administrator/6/Planning_And_Installing/Code42_server_and_app_downloads</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Code 42 Software (9YV9435DHD)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/Install Code42 CrashPlan.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
