<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Code42 and imports it into Munki.

This recipe has been deprecated. Please use the new recipes located here: https://github.com/autopkg/apizz-recipes/tree/master/Code42</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.munki.Code42</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Code42</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Electron Helper (Renderer).app</string>
				<string>Code42.app</string>
				<string>Electron Helper (GPU).app</string>
				<string>Code42Service.app</string>
				<string>Electron Helper (Plugin).app</string>
				<string>Electron Helper.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The Code42 app allows you to back up your device, change backup settings, and download backed up files from all the devices on your account.</string>
			<key>developer</key>
			<string>Code 42 Software</string>
			<key>display_name</key>
			<string>Code42</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>x86_64</string>
			</array>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/bash
#
# From: https://support.code42.com/CrashPlan/6/Get_started/Uninstall_the_Code42_app#Mac_2
#

# The section below uninstalls Code42, if it is installed on the system.
if [[ -e /Library/Application\ Support/CrashPlan/ ]]; then
    launchctl unload /Library/LaunchDaemons/com.crashplan.engine.plist
    launchctl unload /Library/LaunchDaemons/com.code42.service.plist
    /Library/Application\ Support/CrashPlan/Uninstall.app/Contents/Resources/uninstall.sh
fi

# The section below removes the Code42 identity file. Uncomment the lines below if you wish to do a complete uninstall.
rm -r /Library/Application\ Support/CrashPlan/</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Code42</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe has been deprecated. Please use the new recipes located here: https://github.com/autopkg/apizz-recipes/tree/master/Code42</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/Install Code42.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/code42.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Code42.app</string>
				</array>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot/</string>
					<string>%RECIPE_CACHE_DIR%/unpack/</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
