<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for the latest version of Haiku.</string>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.download.Haiku</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Haiku</string>
		<key>DOWNLOAD_URL</key>
		<string>https://releases.haiku.ai/releases/production-master-mac-latest.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Haiku.app</string>
                <key>requirement</key>
                <string>identifier "com.Haiku.HaikuForDesignersAndEngineers" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "TWM39MH96F"</string>
            </dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Haiku.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
