<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for BlueGriffon.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.BlueGriffon</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BlueGriffon</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://bluegriffon.org/#download</string>
				<key>re_pattern</key>
				<string>(http://bluegriffon.org/freshmeat/[0-9a-z\.]+\.[0-9a-z\.]/bluegriffon-[0-9a-z\.]+\.[0-9a-z\.]+\.mac.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
