<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of FFmpeg and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.FFmpeg</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FFmpeg</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>A complete, cross-platform solution to record, convert and stream audio and video.</string>
            <key>display_name</key>
            <string>FFmpeg</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.faumac.pkg.FFmpeg</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installcheck_script</key>
                    <string>#!/bin/zsh --no-rcs

# Copyright 2025, Jamf Software, LLC.

#
# DESCRIPTION
#
# Get ffmpeg version (if installed)
# Exit 1 if ffmpeg is installed and newer than what we have in Munki
#
# Based on:
# https://github.com/autopkg/andrewzirkel-recipes/blob/master/LightspeedRelaySmartAgent/LightspeedRelaySmartAgent.munki.recipe#L46

# Function to compare version strings using sort -V
compare_versions() {
    local version1="$1"
    local version2="$2"

    # Use sort -V to compare versions
    local sorted_first=$(printf '%s\n%s\n' "$version1" "$version2" | sort -V | head -n1)

    if [[ "$sorted_first" == "$version1" ]] &amp;&amp; [[ "$version1" != "$version2" ]]; then
        # version1 is strictly less than version2
        return 0
    else
        # version1 is greater than or equal to version2
        return 1
    fi
}

# Possible FFmpeg binary locations
ffmpeg_locations=("/usr/local/bin/ffmpeg" "/opt/homebrew/bin/ffmpeg" "/usr/bin/ffmpeg")
munki_version="%version%"
ffmpeg_binary=""

# Find the FFmpeg binary
for location in "${ffmpeg_locations[@]}"; do
    if [[ -f "$location" ]]; then
        ffmpeg_binary="$location"
        echo "Found FFmpeg binary at: $ffmpeg_binary"
        break
    fi
done

# If the binary exists
if [[ -n "$ffmpeg_binary" &amp;&amp; -f "$ffmpeg_binary" ]]; then
    echo "Checking FFmpeg version..."
    # Get installed version, extract version number and remove any suffix after dash
    if installed_ver=$("$ffmpeg_binary" -version 2&gt;/dev/null | head -1 | awk '{print $3}' | cut -d'-' -f1); then
        echo "Detected FFmpeg version: '$installed_ver'"
        echo "Expected Munki version: '$munki_version'"
        if [[ -n "$installed_ver" ]]; then
            if compare_versions "$installed_ver" "$munki_version"; then
                echo "Version of ffmpeg older than the munki version, proceeding with install..."
                exit 0
            else
                echo "Version of ffmpeg same or newer than the munki version, skipping..."
                exit 1
            fi
        else
            echo "Could not extract version from ffmpeg output, proceeding with install..."
            exit 0
        fi
    else
        echo "Encountered an error when ascertaining ffmpeg version, proceeding with install..."
        exit 0
    fi
else
    echo "Cannot locate ffmpeg binary in any standard location, proceeding with install..."
    exit 0
fi</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
